Repository: raikasdev/koodieditori
Catalog: src/workers/python/*/friendly_tb_*.po
Languages: fi

source: Perhaps you wrote a statement beginning a code block intended to be part of a dict or set comprehension. You cannot have separate code blocks inside dict or set comprehensions.
fi: Ehkä kirjoitit lausekkeen, joka aloittaa koodilohkon, joka on tarkoitettu osaksi dict- tai set-käsittelyä. dict- tai set-käsittelyjen sisällä ei voi olla erillisiä koodilohkoja.

source: If this explanation is incorrect, please report this case.
fi: Jos tämä selitys on virheellinen, ilmoita tästä tapauksesta.

source: parenthesis `(`
fi: kaarisulje `(`

source: parenthesis `)`
fi: kaarisulje `)`

source: square bracket `[`
fi: hakasulje `[`

source: square bracket `]`
fi: hakasulje `]`

source: curly bracket `{`
fi: aaltosulje `{`

source: curly bracket `}`
fi: aaltosulje `}`

source: Did you mean to use a normal quote character, `'` or `"`?
fi: Tarkoititko käyttää normaalia lainausmerkkiä, `'` tai `"`?

source: I suspect that you used a fancy unicode quotation mark whose name is {name} instead of a normal single or double quote for a string.
fi: Epäilen, että olet käyttänyt hienoa unicode-lainausta, jonka nimi on {name}, tavallisen yksinkertaisen tai kaksinkertaisen lainausmerkin sijasta merkkijonossa.

source: Or perhaps, you meant to write a less than sign, `<`.
fi: Tai ehkä sinun piti kirjoittaa pienempi kuin -merkki, `<`.

source: Or perhaps, you meant to write a greater than sign, `>`.
fi: Tai ehkä sinun piti kirjoittaa suurempi kuin -merkki, `>`.

source: Or perhaps, you meant to write a comma.
fi: Tai ehkä sinun piti kirjoittaa pilkku.

source: I suspect that you used a fancy unicode quotation mark whose name is {name}.
fi: Epäilen, että olet käyttänyt hienoa unicode-lainausta, jonka nimi on {name}.

source: Perhaps, you meant to write a less than sign, `<`.
fi: Ehkä sinun piti kirjoittaa pienempi kuin -merkki, `<`.

source: Did you mean to write a less than sign, `<`?
fi: Tarkoititko kirjoittaa pienemmän kuin -merkin, `<`?

source: Perhaps, you meant to write a greater than sign, `>`.
fi: Ehkä sinun piti kirjoittaa suurempi kuin -merkki, `>`.

source: Did you mean to write a greater than sign, `>`?
fi: Tarkoititko kirjoittaa suuremman kuin -merkin, `>`?

source: Perhaps, you meant to write a comma.
fi: Ehkä sinun piti kirjoittaa pilkku.

source: I suspect that you used the unicode character known as 'FRACTION SLASH', which looks similar to but is different from the division operator `/`.
fi: Epäilen, että olet käyttänyt unicode-merkkiä, joka tunnetaan nimellä "FRACTION SLASH", joka näyttää samankaltaiselta kuin jako-operaattori `/`, mutta on eri.

source: Did you use a unicode fraction?
fi: Käytitkö unicode-fraktiota?

source: I suspect that you used the unicode character `{char}`meant to represent a fraction. The name of this unicode character is {name}.
fi: Epäilen, että olet käyttänyt unicode-merkkiä `{char}`, jonka tarkoitus on esittää murtolukua. Tämän unikoodimerkin nimi on {name}.

source: Did you mean `{num}/{denom}`?
fi: Tarkoititko `{num}/{denom}`?

source: You used the unicode character {char} which is known as {name} I suspect that you meant to write the fraction `{num}/{denom}` instead.
fi: Käytit unicode-merkkiä {char}, joka tunnetaan nimellä {name} Epäilen, että tarkoituksesi oli kirjoittaa sen sijaan murto `{num}/{denom}`.

source: You have {container_type} followed by square brackets, `[...]`. What is included between the square brackets, `[...]`, must be either an integer or a slice (`start:stop` or `start:stop:step`) and you have used {obj_type} instead.
fi: Sinulla on {container_type}, jota seuraa hakasulkeissa `[...]`. Hakasulkeiden välissä olevan `[...]` on oltava joko kokonaisluku tai viipale (`start:stop` tai `start:stop:step`), ja olet käyttänyt {obj_type} sen sijaan.
