Repository: raikasdev/koodieditori
Catalog: src/workers/python/*/friendly_tb_*.po
Languages: fi

source: You wrote an expression that includes some mathematical operations on the left-hand side of the equal sign which should be only used to assign a value to a variable.
fi: Kirjoitit lausekkeen, joka sisältää joitakin matemaattisia operaatioita yhtäläisyysmerkin vasemmalla puolella, jota pitäisi käyttää vain arvon antamiseen muuttujalle.

source: Perhaps you meant to write `{name}` instead of `{original}`
fi: Ehkä sinun piti kirjoittaa `{name}` eikä `{original}`.

source: Perhaps you needed `==` instead of `=`.
fi: Ehkä tarvitsit `==` eikä `=`.

source: You wrote an expression that includes the `yield` keyword on the left-hand side of the equal sign. You cannot assign a value to such an expression. Note that, like the keyword `return`, `yield` can only be used inside a function.
fi: Kirjoitit lausekkeen, joka sisältää `yield`-avainsanan yhtäläisyysmerkin vasemmalla puolella. Et voi antaa arvoa tällaiselle lausekkeelle. Huomaa, että kuten avainsanaa `return`, `yield` voidaan käyttää vain funktion sisällä.

source: You are using the augmented assignment operator `:=` inside a comprehension to assign a value to the iteration variable `{var}`. This variable is meant to be used only inside the comprehension. The augmented assignment operator is normally used to assign a value to a variable so that the variable can be reused later. This is not possible for variable `{var}`.
fi: Käytät laajennettua osoitusoperaattoria `:=` ymmärrettävyyden sisällä osoittaaksesi arvon iteraatiomuuttujalle `{var}`. Tätä muuttujaa on tarkoitus käyttää vain ymmärrettävyyden sisällä. Laajennettua osoitusoperaattoria käytetään normaalisti osoittamaan arvo muuttujalle, jotta muuttujaa voidaan käyttää myöhemmin uudelleen. Tämä ei ole mahdollista muuttujalle `{var}`.

source: The object named `{name}` is defined with type annotation as a local variable. It cannot be declared to be a global variable.
fi: Objekti nimeltä `{name}` on määritelty tyyppimerkinnällä paikalliseksi muuttujaksi. Sitä ei voi ilmoittaa globaaliksi muuttujaksi.

source: You cannot use the augmented assignment operator `:=`, sometimes called the walrus operator, with literals like `{bad_token}`. You can only assign objects to identifiers (variable names).
fi: Et voi käyttää laajennettua osoitusoperaattoria `:=`, jota kutsutaan joskus mursuoperaattoriksi, kirjaimilla kuten `{bad_token}`. Voit osoittaa objekteja vain tunnisteille (muuttujien nimille).

source: You declared `{name}` as being both a global and nonlocal variable. A variable can be global, or nonlocal, but not both at the same time.
fi: Ilmoitit `{name}` sekä globaaliksi että ei-paikalliseksi muuttujaksi. Muuttuja voi olla globaali tai ei-paikallinen, mutta ei molempia samaan aikaan.

source: Python tells us that the {bracket} was never closed.
fi: Python kertoo meille, että {bracket} ei koskaan suljettu.

source: The {bracket} was never closed.
fi: {bracket} ei koskaan suljettu.

source: The Python keyword `break` can only be used inside a `for` loop or inside a `while` loop.
fi: Pythonin avainsanaa `break` voidaan käyttää vain `for`-silmukan tai `while`-silmukan sisällä.

source: You likely used an assignment operator `=` instead of an equality operator `==`.
fi: Olet todennäköisesti käyttänyt osoitusoperaattoria `=` tasa-arvooperaattorin `==` sijasta.

source: The following statement would not contain a syntax error: {new_statement}
fi: Seuraava lauseke ei sisällä syntaksivirhettä: {new_statement}.

source: You cannot delete the constant `{constant}`.
fi: Et voi poistaa vakiota `{constant}`.

source: You cannot delete a Python expression.
fi: Python-lauseketta ei voi poistaa.

source: You cannot delete the expression `{expression}`.
fi: Lauseketta `{expression}` ei voi poistaa.

source: You attempted to delete a function call {line} instead of deleting the function's name {correct}
fi: Yritit poistaa funktiokutsun {line} sen sijaan, että olisit poistanut funktion nimen {correct}.

source: You cannot delete the literal `{literal}`.
fi: Et voi poistaa kirjainta `{literal}`.

source: You cannot delete the named expression `{expression}`.
fi: Nimettyä lauseketta `{expression}` ei voi poistaa.

source: The star operator `*` is interpreted to mean that iterable unpacking is to be used to assign a name to each item of an iterable, which does not make sense here.
fi: Tähtioperaattorin `*` tulkitaan tarkoittavan, että iterable unpackingia käytetään nimen antamiseen jokaiselle iterable-oliolle, mikä ei ole järkevää tässä tapauksessa.

source: It looks like you surrounded a starred name by parentheses. This was not considered a SyntaxError before Python version 3.9.
fi: Näyttää siltä, että ympäröit tähtimerkin nimen sulkeilla.Tätä ei pidetty SyntaxErrorina ennen Pythonin versiota 3.9.

source: Did you forget a colon?
fi: Unohditko kaksoispisteen?

source: Python expected a colon at the position indicated.
fi: Python odotti kaksoispistettä osoitetussa kohdassa.

source: It looks like the error occurred as you were writing a Python dict. Perhaps you wrote a dict key without writing the corresponding value.
fi: Näyttää siltä, että virhe ilmeni, kun kirjoitit Python dict:tä. Ehkä kirjoitit dict-avaimen kirjoittamatta vastaavaa arvoa.

source: Did you forget to write a dict value?
fi: Unohditko kirjoittaa dict-arvon?

source: The Python keyword `continue` can only be used inside a `for` loop or inside a `while` loop.
fi: Pythonin avainsanaa `continue` voidaan käyttää vain `for`-silmukan tai `while`-silmukan sisällä.

source: You have defined a function repeating the argument {name} Each argument should appear only once in a function definition.
fi: Olet määrittänyt funktion, jossa toistuu argumentti {name} Jokainen argumentti saa esiintyä vain kerran funktion määrittelyssä.

source: Did you forget to add `else`?
fi: Unohditko lisätä `else`?

source: An `else some_value` clause was expected after the `if` expression.
fi: Jos-lausekkeen jälkeen odotettiin `else some_value`-lauseketta.

source: You started writing a triple-quoted string but never wrote the triple quotes needed to end the string.
fi: Aloitit kolminkertaisten lainausmerkkien kirjoittamisen, mutta et koskaan kirjoittanut kolminkertaisia lainausmerkkejä, joita tarvitaan merkkijonon päättämiseen.

source: Did you forget a closing quote?
fi: Unohditko loppusitaatin?

source: You started writing a string with a single or double quote but never ended the string with another quote on that line.
fi: Aloitit merkkijonon kirjoittamisen yksinkertaisella tai kaksinkertaisella lainausmerkillä, mutta et koskaan päättänyt merkkijonoa toiseen lainausmerkkiin kyseisellä rivillä.

source: Perhaps you meant to write the backslash character, `\` as the last character in the string and forgot that you needed to escape it by writing two `\` in a row.
fi: Ehkä sinun oli tarkoitus kirjoittaa backslash-merkki `\` merkkijonon viimeiseksi merkiksi ja unohdit, että sinun piti välttää se kirjoittamalla kaksi `\` peräkkäin.

source: Did you forget to escape a backslash character?
fi: Unohditko välttää backslash-merkin?

source: Perhaps you forgot to escape a quote character.
fi: Ehkä unohdit välttää lainausmerkin.

source: I suspect that you were trying to use a quote character inside a string that was enclosed in quotes of the same kind. Perhaps you should have escaped the inner quote character: {new_line} {mark}
fi: Epäilen, että yritit käyttää lainausmerkkiä sellaisen merkkijonon sisällä, joka oli suljettu samantyyppisiin lainausmerkkeihin. Ehkä sinun olisi pitänyt poistaa sisäinen lainausmerkki: {new_line} {mark}

source: You wrote a `try` block which did not include an `except` nor a `finally` block.
fi: Kirjoitit `try`-lohkon, joka ei sisältänyt `except`- eikä `finally`-lohkoa.

source: Perhaps you meant to write {new_statement}
fi: Ehkä sinun piti kirjoittaa {new_statement}

source: Did you mean `{new_statement}`?
fi: Tarkoititko `{new_statement}`?

source: Perhaps you meant to write either {new_statement} or {new_statement2}
fi: Ehkä sinun piti kirjoittaa joko {new_statement} tai {new_statement2}.

source: You likely called a function using the Python keyword `{keyword}` as an argument: a_function({keyword}=something) which Python interpreted as trying to assign a value to a Python keyword.
fi: Kutsuit todennäköisesti funktiota käyttäen Pythonin avainsanaa `{keyword}` argumenttina: funktio({keyword}=jotain), jonka Python tulkitsi yrittävän antaa arvon Pythonin avainsanalle.

source: You likely called a function with a named argument: a_function(invalid=something) where `invalid` is not a valid variable name in Python either because it starts with a number, or is a string, or contains a period, etc.
fi: Kutsuit todennäköisesti funktiota nimetyllä argumentilla: a_function(invalid=jotain), jossa `invalid` ei ole kelvollinen muuttujan nimi Pythonissa joko siksi, että se alkaa numerolla, on merkkijono, sisältää pisteen jne.

source: It looks like the error occurred as you were writing a Python dict. Perhaps you forgot to write a value after a colon.
fi: Näyttää siltä, että virhe tapahtui, kun kirjoitit Python-diktiä. Ehkä unohdit kirjoittaa arvon kaksoispisteen jälkeen.

source: You have written an f-string whose content `{...}` includes a backslash; this is not allowed. Perhaps you can replace the part that contains a backslash by some variable. For example, suppose that you have an f-string like: f"{... 'hello\n' ...}" you could write this as hello = 'hello\n' f"{... hello ...}"
fi: Olet kirjoittanut f-merkkijonon, jonka sisältö `{...}` sisältää backslash-viivan; tämä ei ole sallittua. Ehkä voit korvata backslash-viivan sisältävän osan jollain muuttujalla. Oletetaan esimerkiksi, että sinulla on f-merkkijono seuraavasti: f"{.... 'hello\n' ...}" voit kirjoittaa tämän seuraavasti: hello = 'hello\n' f"{... hello ...}"

source: You have written an f-string which has an unmatched `}`. If you want to print a single `}`, you need to write `}}` in the f-string; otherwise, you need to add an opening `{`.
fi: Olet kirjoittanut f-merkkijonon, jossa on yhdistämätön `}`. Jos haluat tulostaa yhden `}`:n, sinun on kirjoitettava `}}` f-merkkijonoon; muuten sinun on lisättävä avaava `{`.

source: You have written an f-string which has an unmatched `{`. If you want to print a single `{`, you need to write `{{` in the f-string; otherwise, you need to add a closing `}`.
fi: Olet kirjoittanut f-merkkijonon, jossa on yhteensopimaton `{`. Jos haluat tulostaa yhden `{`, sinun on kirjoitettava `{{` f-merkkijonoon; muussa tapauksessa sinun on lisättävä päättävä `}`.

source: I am guessing that you were writing a comprehension or a generator expression and forgot to include parentheses around tuples. As an example, instead of writing [i, i**2 for i in range(10)] you would need to write [(i, i**2) for i in range(10)]
fi: Oletan, että kirjoitit ymmärrystä tai generaattorilauseketta ja unohdit sulkeet tuplien ympärille. Esimerkiksi sen sijaan, että kirjoittaisit [i, i**2 for i in range(10)], sinun pitäisi kirjoittaa [(i, i**2) for i in range(10)].

source: A `from __future__ import` statement changes the way Python interprets the code in a file. It must appear at the beginning of the file.
fi: `from __future__ import`-lauseke muuttaa tapaa, jolla Python tulkitsee tiedoston koodia. Sen on oltava tiedoston alussa.

source: The available features are `{names}`.
fi: Käytettävissä olevat ominaisuudet ovat `{names}`.

source: When using a `from __future__ import` statement, you must import specific named features.
fi: Kun käytät `from __future__ import`-lausetta, sinun on tuotava tiettyjä nimettyjä ominaisuuksia.

source: Instead of `{feature}`, perhaps you meant to import `{name}`.
fi: `{feature}`:n sijasta ehkä tarkoitit tuoda `{name}`.

source: `{feature}` is not a valid feature of module `__future__`.
fi: `{feature}` ei ole moduulin `__future__` kelvollinen ominaisuus.

source: You are using a generator expression, something of the form x for x in thing You must add parentheses enclosing that expression.
fi: Käytät generaattorilauseketta, joka on muodoltaan x for x in thing Sinun on lisättävä sulkeet lausekkeen ympärille.

source: I suspect you wrote `from __future__ import braces` following someone else's suggestion. This will never work. Unlike other programming languages, Python's code block are defined by their indentation level, and not by using some curly braces, like `{...}`.
fi: Epäilen, että kirjoitit `from __future__ import braces` jonkun toisen ehdotuksen perusteella. Toisin kuin muissa ohjelmointikielissä, Pythonissa koodilohkot määritellään sisennystasolla, eikä käyttämällä sulkeita, kuten `{...}`.

source: Did you use copy-paste?
fi: Käytitkö copy-pastea?

source: Python indicates that you used the unicode character `{bad_character}` which is not allowed.
fi: Python osoittaa, että käytit unicode-merkkiä `{bad_character}`, joka ei ole sallittu.

source: Python tells us that you have written an invalid number.
fi: Python kertoo, että olet kirjoittanut virheellisen luvun.

source: However, I think that the problem might be the following.
fi: Luulen kuitenkin, että ongelma saattaa olla seuraavanlainen.

source: I have no suggestion to offer to fix this problem.
fi: Minulla ei ole mitään ehdotusta tämän ongelman korjaamiseksi.

source: The double star operator `**` is likely interpreted to mean that dict unpacking is to be used which is not allowed or does not make sense here.
fi: Kaksoistähtioperaattorin `**` tulkitaan todennäköisesti tarkoittavan, että on käytettävä dict-pakkauksen purkamista, mikä ei ole sallittua tai ei ole järkevää tässä tapauksessa.

source: You cannot use the `*` operator to unpack the iteration variable in a comprehension.
fi: Et voi käyttää `*`-operaattoria iteraatiomuuttujan purkamiseen ymmärryksessä.

source: The following statement has no syntax error: {statement}
fi: Seuraavassa lausumassa ei ole syntaksivirhettä: {statement}

source: You have called a function repeating the same keyword argument (`{arg}`). Each keyword argument should appear only once in a function call.
fi: Olet kutsunut funktiota toistamalla saman avainsana-argumentin (`{arg}`). Jokainen avainsana-argumentti saa esiintyä vain kerran funktiokutsussa.

source: Python tells us that the closing `{closing}` on the last line shown does not match the opening `{opening}` on line {lineno}.
fi: Python kertoo meille, että viimeisen näytetyn rivin sulkeutuva `{closing}` ei vastaa rivin {lineno} avautuvaa `{opening}`.

source: Python tells us that the closing `{closing}` on the last line shown does not match the opening `{opening}`.
fi: Python kertoo meille, että viimeisen rivin sulkeutuva `{closing}` ei vastaa avautuvaa `{opening}`.

source: Did you forget something after `*`?
fi: Unohditko jotain `*` jälkeen?

source: Assuming you were defining a function, you need to replace `*` by either `*arguments` or by `*, named_argument=value`.
fi: Jos oletetaan, että olet määrittämässä funktiota, sinun on korvattava `*` joko sanalla `*arguments` tai sanalla `*, named_argument=value`.

source: You assigned a value to the variable `{name}` before declaring it as a global variable.
fi: Annoit muuttujalle `{name}` arvon ennen kuin ilmoitit sen globaaliksi muuttujaksi.

source: Did you forget to add `nonlocal`?
fi: Unohditko lisätä `nonlocal`?

source: You assigned a value to the variable `{name}` before declaring it as a nonlocal variable.
fi: Annoit arvon muuttujalle `{name}` ennen kuin ilmoitit sen ei-paikalliseksi muuttujaksi.

source: You are including the statement {newline} indicating that `{name}` is a variable defined outside a function. You are also using the same `{name}` as an argument for that function, thus indicating that it should be variable known only inside that function, which is the contrary of what `global` implied.
fi: Sisällytät lausekkeen {newline} osoittaen, että `{name}` on muuttuja, joka on määritelty funktion ulkopuolella. Käytät samaa `{name}` myös kyseisen funktion argumenttina, mikä osoittaa, että sen pitäisi olla muuttuja, joka tunnetaan vain kyseisen funktion sisällä, mikä on päinvastoin kuin mitä `global` tarkoitti.

source: You used `{name}` as a parameter for a function before declaring it also as a nonlocal variable: `{name}` cannot be both at the same time.
fi: Käytit `{name}` funktion parametrina ennen kuin ilmoitit sen myös ei-paikalliseksi muuttujaksi: `{name}` ei voi olla molempia samaan aikaan.

source: You used the variable `{name}` before declaring it as a global variable.
fi: Käytit muuttujaa `{name}` ennen kuin ilmoitit sen globaaliksi muuttujaksi.

source: Did you forget to write `nonlocal` first?
fi: Unohditko kirjoittaa `nonlocal` ensin?

source: You used the variable `{name}` before declaring it as a nonlocal variable.
fi: Käytit muuttujaa `{name}` ennen kuin ilmoitit sen ei-paikalliseksi muuttujaksi.

source: You declared the variable `{name}` as being a nonlocal variable but it cannot be found.
fi: Ilmoitit muuttujan `{name}` ei-paikalliseksi muuttujaksi, mutta sitä ei löydy.

source: You used the nonlocal keyword at a module level. The nonlocal keyword refers to a variable inside a function given a value outside that function.
fi: Käytit nonlocal-avainsanaa moduulitasolla. Nonlocal-avainsana viittaa funktion sisällä olevaan muuttujaan, jolle annetaan arvo funktion ulkopuolella.

source: In Python, you can define functions with only positional arguments def test(a, b, c): ... or only keyword arguments def test(a=1, b=2, c=3): ... or a combination of the two def test(a, b, c=3): ... but with the keyword arguments appearing after all the positional ones. According to Python, you used positional arguments after keyword ones.
fi: Pythonissa voit määritellä funktioita, joilla on vain sijaintiargumentit def test(a, b, c): ... tai vain avainsana-argumentteja def test(a=1, b=2, c=3): ... tai näiden kahden yhdistelmä def test(a, b, c=3): ... mutta avainsana-argumentit esiintyvät kaikkien asema-argumenttien jälkeen. Pythonin mukaan käytit asema-argumentteja avainsana-argumenttien jälkeen.

source: I am guessing that you wanted to use an `except` statement with multiple exception types. If that is the case, you must surround them with parentheses.
fi: Arvelen, että halusit käyttää `except`-lauseketta useiden virhetyyppien kanssa. Jos näin on, ne on ympäröity sulkuilla.

source: In Python, you can call functions with only positional arguments test(1, 2, 3) or only keyword arguments test(a=1, b=2, c=3) or a combination of the two test(1, 2, c=3) but with the keyword arguments appearing after all the positional ones. According to Python, you used positional arguments after keyword ones.
fi: Pythonissa voit kutsua funktioita, joissa on vain sijaintiargumentit test(1, 2, 3) tai vain avainsana-argumentit test(a=1, b=2, c=3) tai näiden kahden yhdistelmä test(1, 2, c=3), mutta avainsana-argumentit esiintyvät kaikkien sijaintiargumenttien jälkeen. Pythonin mukaan käytit sijaintiargumentteja avainsana-argumenttien jälkeen.

source: Perhaps you need to type print({message}) In older version of Python, `print` was a keyword. Now, `print` is a function; you need to use parentheses to call it.
fi: Ehkä sinun täytyy kirjoittaa print({message}) Pythonin vanhemmassa versiossa `print` oli avainsana. Nyt `print` on funktio; sinun täytyy käyttää sulkuja kutsuaksesi sitä.

source: Note that arguments of `print` must be separated by commas.
fi: Huomaa, että `print`-argumentit on erotettava toisistaan pilkuilla.

source: Did you mean `print({message})`?
fi: Tarkoititko `print({message})`?

source: You can only use a `return` statement inside a function or method.
fi: Voit käyttää `return`-lausetta vain funktion tai metodin sisällä.

source: A star assignment must be of the form: ... *name = list_or_tuple
fi: Tähtitehtävän on oltava muodoltaan: ... *name = list_or_tuple

source: It looks like you tried to use a starred expression as a dict value; this is not allowed.
fi: Näyttää siltä, että olet yrittänyt käyttää tähdellä varustettua lauseketta dict-arvona; tämä ei ole sallittua.

source: Your code is too complex for Python: you need to reduce the number of indented code blocks contained inside other code blocks.
fi: Koodisi on liian monimutkaista Pythonille: sinun on vähennettävä muiden koodilohkojen sisällä olevien sisennettyjen koodilohkojen määrää.

source: Your code is too complex for Python: you need to reduce the number of parentheses contained inside other parentheses.
fi: Koodisi on liian monimutkainen Pythonille: sinun on vähennettävä muiden sulkujen sisällä olevien sulkujen määrää.

source: Python indicates that you need to surround an expression ending with a comma by parentheses.
fi: Python ilmoittaa, että pilkkuun päättyvä lauseke on ympäröity sulkuilla.

source: I have no additional suggestion to offer. Please feel free to report this case.
fi: Minulla ei ole muita ehdotuksia, mutta voitte vapaasti ilmoittaa tästä tapauksesta.

source: Perhaps you meant to write `{new_statement}`
fi: Ehkä sinun piti kirjoittaa `{new_statement}`.

source: However, I suspect that you wrote the keyword `{boolean}` by mistake.
fi: Epäilen kuitenkin, että kirjoitit avainsanan `{boolean}` vahingossa.

source: The Python keyword `{boolean}` can only be used for boolean expressions.
fi: Pythonin avainsanaa `{boolean}` voidaan käyttää vain boolean-lausekkeissa.

source: However, if you remove the last comma, there will be no syntax error.
fi: Jos kuitenkin poistat viimeisen pilkun, syntaksivirhettä ei tule.

source: You are using the continuation character `\` outside of a string, and it is followed by some other character(s).
fi: Käytät jatkomerkkiä `\` merkkijonon ulkopuolella, ja sitä seuraa jokin muu merkki tai merkkejä.

source: I am guessing that you wanted to divide by the number {number} and wrote \ instead of /.
fi: Arvelen, että halusit jakaa luvulla {number} ja kirjoitit \ eikä /.

source: Did you mean to divide by {number}?
fi: Tarkoititko jakaa {number}?

source: I am guessing that you forgot to enclose some content in a string.
fi: Oletan, että unohdit liittää jonkin sisällön merkkijonoon.

source: Python tells us that it reached the end of the file and expected more content.
fi: Python kertoo, että se on saavuttanut tiedoston lopun ja odottaa lisää sisältöä.

source: I will attempt to be give a bit more information.
fi: Yritän antaa hieman enemmän tietoa.

source: I suspect that you wrote a string that contains one backslash character, `\` followed by an uppercase `U` and some more characters. Python likely interpreted this as indicating the beginning of what is known as an escape sequence for special unicode characters. To solve the problem, either write a so-called 'raw string' by adding the letter `r` as a prefix in front of the string, or replace `\U`, by `\\U`.
fi: Epäilen, että kirjoitit merkkijonon, joka sisältää yhden backslash-merkin, `\`, jota seuraa iso kirjain `U` ja joitakin muita merkkejä. Python tulkitsi tämän todennäköisesti osoittavan niin sanotun escape-sekvenssin alkua unicode-erikoismerkkejä varten. Ongelman ratkaisemiseksi kirjoita joko niin sanottu "raaka merkkijono" lisäämällä merkkijonon eteen kirjain `r` tai korvaa `\U` merkillä `\\\U`.

source: The closing {bracket} on line {linenumber} does not match anything.
fi: Rivin {linenumber} sulkeva {bracket} ei vastaa mitään.

source: Perhaps you forgot a closing quote.
fi: Ehkä unohdit loppulausuman.

source: Inside the f-string `{fstring}`, you have another string, which starts with either a single quote (') or double quote ("), without a matching closing one.
fi: F-stringin `{fstring}` sisällä on toinen merkkijono, joka alkaa joko yksinkertaisella lainausmerkillä (') tai kaksinkertaisella lainausmerkillä (") ilman vastaavaa sulkevaa lainausmerkkiä.
