Repository: raikasdev/koodieditori
Catalog: src/workers/python/*/friendly_tb_*.po
Languages: fi

source: When base `0` is specified, `int()` expects the argument to be an integer literal, written in base 2 (`0b...`), 8 (`0o...`), 10, or 16 (`0x...`).
fi: Kun perusta `0` on määritetty, `int()` odottaa argumentin olevan kokonaislukuliite, joka on kirjoitettu peruslukuna 2 (`0b...`), 8 (`0o...`), 10 tai 16 (`0x...`).

source: In base `{base}`, `int()` is most often use to convert a string containing the digits `0` to `{max_n}` into an integer.
fi: Perusmuodossa `{base}`, `int()` käytetään useimmiten muuntamaan numeroita `0` - `{max_n}` sisältävä merkkijono kokonaisluvuksi.

source: In base `11`, `int()` is most often use to convert a string containing the digits `0` to `9` and the letter `'a'` into an integer.
fi: Peruslukua `11` käytettäessä `int()` käytetään useimmiten muuntamaan merkkijono, joka sisältää numerot `0` - `9` ja kirjaimen `'a`, kokonaisluvuksi.

source: In base `base`, `int()` is most often use to convert a string containing the digits `0` to `9` and the letters from `'a'` to `'{max_n}'` into an integer.
fi: Perusmuodossa `base`, `int()` käytetään useimmiten muuntamaan merkkijono, joka sisältää numerot `0` - `9` ja kirjaimet `'a'` - `'{max_n}'`, kokonaisluvuksi.

source: You need to convert `'{value}'` to a float first.
fi: Sinun on ensin muunnettava `'{value}'` floatiksi.

source: The string `'{value}'` needs to be first converted using `float()` before the result can be converted into an integer using `int()`.
fi: Merkkijono `'{value}'` on ensin muunnettava käyttäen `float()` ennen kuin tulos voidaan muuntaa kokonaisluvuksi käyttäen `int()`.

source: The argument `base` of `int()` must be either zero or any integer from 2 to 36.
fi: `int()`:n argumentin `base` on oltava joko nolla tai mikä tahansa kokonaisluku välillä 2-36.

source: You wrote {base} which is not allowed.
fi: Kirjoitit {base}, mikä ei ole sallittua.

source: Did you specify an invalid month?
fi: Määrititkö virheellisen kuukauden?

source: I am guessing that you specify an invalid value for a month in a `date` object. Valid values are integers, from 1 to 12.
fi: Oletan, että olet määrittänyt `päivämäärä`-objektiin kuukauden virheellisen arvon. Kelvolliset arvot ovat kokonaislukuja 1-12.

source: The string `{string}` cannot be converted to a `float` as it does not represent a number.
fi: Merkkijonoa `{string}` ei voida muuntaa `floatiksi`, koska se ei edusta numeroa.

source: The name `{var}` is used both as the name of a class variable and as a string item in the class `__slots__`; this is not allowed.
fi: Nimeä `{var}` käytetään sekä luokkamuuttujan nimenä että merkkijonoelementtinä luokassa `__slots__`; tämä ei ole sallittua.

source: The third argument of the function `pow()` cannot be zero.
fi: Funktion `pow()` kolmas argumentti ei voi olla nolla.

source: I do not recognize this error message. I am guessing that the problem is with the function `{name}`.
fi: En tunnista tätä virheilmoitusta, ja arvelen, että ongelma on funktiossa `{name}`.

source: Its docstring is: {docstring}
fi: Sen docstring on seuraava: {docstring}

source: I have no more information.
fi: Minulla ei ole enempää tietoa.

source: The value you gave for the time is not in the format you specified. Make sure to use the same separator between items (for example, between day and month) and keep the order the same in both the data provided and the format you specified. The following table might be useful: https://docs.python.org/3/library/time.html#time.strftime The following site might also be useful: https://www.strfti.me/
fi: Kellonajalle antamasi arvo ei ole määrittämässäsi muodossa. Varmista, että käytät samaa erotinta kohtien välillä (esimerkiksi päivän ja kuukauden välillä) ja pidät järjestyksen samana sekä annetuissa tiedoissa että määrittämässäsi muodossa. Seuraava taulukko voi olla hyödyllinen: https://docs.python.org/3/library/time.html#time.strftime Myös seuraava sivusto voi olla hyödyllinen: https://www.strfti.me/.

source: You have attempted to remove `{item}` from the list `{the_list}`. However, `{the_list}` does not contain `{item}`.
fi: Olet yrittänyt poistaa `{item}` luettelosta `{the_list}`. `{the_list}` ei kuitenkaan sisällä `{item}`.

source: You have attempted to remove an item from the list `{the_list}`. However, `{the_list}` does not contain that item.
fi: Olet yrittänyt poistaa kohteen luettelosta `{the_list}`. `{the_list}` ei kuitenkaan sisällä kyseistä kohdetta.

source: You have attempted to remove an item a list that does not contain such an item.
fi: Olet yrittänyt poistaa kohteen luettelosta, joka ei sisällä tällaista kohdetta.

source: An explanation of `{exception}` already exists. If you think that a better explanation can be given, please file an issue.
fi: Selitys sanalle `{exception}` on jo olemassa. Jos uskot, että parempi selitys voidaan antaa, jätä ongelma.

source: Using the modulo operator, `%`, you are dividing by zero.
fi: Modulo-operaattorilla `%` jaat nollalla.

source: You are dividing by zero.
fi: Jaat nollalla.

source: You are dividing by the following term {expression} which is equal to zero.
fi: Jaat seuraavalla termillä {expression}, joka on nolla.

source: The following mathematical expression includes a division by zero: {expression}
fi: Seuraava matemaattinen lauseke sisältää jakamisen nollalla: {expression}

source: Using the modulo operator, `%`, you are dividing by the following term {expression} which is equal to zero.
fi: Käyttämällä modulo-operaattoria, `%`, jaat seuraavalla termillä {expression}, joka on nolla.

source: The second argument of the `divmod()` function is zero.
fi: Funktion `divmod()` toinen argumentti on nolla.

source: You are attempting to raise the number 0 to a negative power which is equivalent to dividing by zero.
fi: Yrität nostaa luvun 0 negatiiviseen potenssiin, mikä vastaa jakamista nollalla.

source: The following mathematical expression includes a division by zero done using the modulo operator: {expression}
fi: Seuraava matemaattinen lauseke sisältää nollalla jakamisen modulo-operaattorin avulla: {expression}

source: The second argument of the `divmod()` function is equal to zero.
fi: Funktion `divmod()` toinen argumentti on nolla.

source: Currently, I cannot guess the likely cause of this error. Try to examine closely the line indicated as well as the line immediately above to see if you can identify some misspelled word, or missing symbols, like (, ), [, ], :, etc. Unless your code uses type annotations, which are beyond our scope, if you think that this is something which should be handled by friendly, please report this case to https://github.com/friendly-traceback/friendly-traceback/issues
fi: Tällä hetkellä en pysty arvaamaan tämän virheen todennäköistä syytä. Yritä tutkia tarkkaan merkittyä riviä sekä välittömästi sen yläpuolella olevaa riviä ja katso, voitko tunnistaa jonkin väärin kirjoitetun sanan tai puuttuvia symboleja, kuten (, ), [, ], : jne. Ellei koodissasi käytetä tyyppihuomautuksia, jotka eivät kuulu toimialueemme piiriin, jos luulet, että tämä on asia, joka pitäisi käsitellä friendly-ohjelmalla, ilmoita tästä tapauksesta osoitteeseen https://github.com/friendly-traceback/friendly-traceback/issues.

source: Python told us that it expected a colon at the position indicated. However, adding a colon or replacing something else by a colon would not fix the problem.
fi: Python kertoi meille, että se odotti kaksoispisteen olevan osoitetussa kohdassa. Kaksoispisteen lisääminen tai jonkin muun kohdan korvaaminen kaksoispisteellä ei kuitenkaan korjaisi ongelmaa.

source: Python gave us the following informative message about the possible cause of the error: {message} However, I do not recognize this information and I have to guess what caused the problem, but I might be wrong.
fi: Python antoi meille seuraavan informatiivisen viestin mahdollisesta virheen syystä: {message} En kuitenkaan tunnista tätä tietoa, ja minun on arvattava, mikä aiheutti ongelman, mutta saatan olla väärässä.

source: However, making such a change would still not correct all the syntax errors in the code you wrote.
fi: Tällainen muutos ei kuitenkaan korjaisi kaikkia kirjoittamasi koodin syntaksivirheitä.

source: The correct syntax is: {async_}def name ( ... ):
fi: Oikea syntaksi on: {async_}def name ( ... ):

source: A function needs a name.
fi: Funktio tarvitsee nimen.

source: You tried to define a function and did not use the correct syntax.
fi: Yritit määritellä funktion etkä käyttänyt oikeaa syntaksia.

source: Functions and methods need a name.
fi: Funktiot ja metodit tarvitsevat nimen.

source: You tried to define a function or method and did not use the correct syntax.
fi: Yritit määritellä funktiota tai metodia etkä käyttänyt oikeaa syntaksia.

source: Did you forget parentheses?
fi: Unohditko sulkeet?

source: Perhaps you forgot to include parentheses. You might have meant to write {line}
fi: Ehkä unohdit laittaa sulut. Olisit ehkä halunnut kirjoittaa {line}.

source: A function definition statement must end with a colon.
fi: Funktion määrittelylausekkeen on päätyttävä kaksoispisteeseen.

source: Did you forget to write a colon?
fi: Unohditko kirjoittaa kaksoispisteen?

source: You wrote `{bad}` instead of a colon.
fi: Kirjoitit `{bad}` kaksoispisteen sijasta.

source: Did you write something by mistake after the colon?
fi: Kirjoititko vahingossa jotain kaksoispisteen jälkeen?

source: A block of code must come after the colon.
fi: Koodilohkon on tultava kaksoispisteen jälkeen.

source: Removing `{bad}`, might fix the problem.
fi: `{bad}` poistaminen saattaa korjata ongelman.

source: You cannot use a Python keyword as a function name.
fi: Python-avainsanaa ei voi käyttää funktion nimenä.

source: You tried to use the Python keyword `{kwd}` as a function name.
fi: Yritit käyttää Pythonin avainsanaa `{kwd}` funktion nimenä.

source: There are more syntax errors later in your code.
fi: Koodissasi on lisää syntaksivirheitä myöhemmin.

source: You wrote an invalid function name.
fi: Kirjoitit virheellisen funktion nimen.

source: The name of a function must be a valid Python identifier, that is a name that begins with a letter or an underscore character, `_`, and which contains only letters, digits or the underscore character.
fi: Funktion nimen on oltava kelvollinen Python-tunniste, eli nimi, joka alkaa kirjaimella tai alleviivausmerkillä `_` ja joka sisältää vain kirjaimia, numeroita tai alleviivausmerkkejä.

source: You attempted to use a string as a function name.
fi: Yritit käyttää merkkijonoa funktion nimenä.

source: You forgot to name your function.
fi: Unohdit nimetä funktiosi.

source: However, there are some other syntax errors in your code.
fi: Koodissasi on kuitenkin joitakin muita syntaksivirheitä.

source: I am guessing that you tried to use the Python keyword `{kwd}` as an argument in the definition of a function where an identifier (variable name) was expected.
fi: Arvelen, että yritit käyttää Pythonin avainsanaa `{kwd}` argumenttina funktion määrittelyssä, jossa odotettiin tunnusta (muuttujan nimeä).

source: You cannot use dotted names as function arguments.
fi: Et voi käyttää pistemäisiä nimiä funktion argumentteina.

source: Perhaps you meant to write a comma.
fi: Ehkä sinun piti kirjoittaa pilkku.

source: Did you mean to write a comma?
fi: Oliko sinun tarkoitus kirjoittaa pilkku?

source: You cannot use dots in function names.
fi: Toimintojen nimissä ei voi käyttää pisteitä.

source: `/` indicates that the previous arguments in a function definition are positional arguments.
fi: `/` osoittaa, että funktion määrittelyn edelliset argumentit ovat sijaintiargumentteja.

source: Function definitions cannot include the symbol `/` in this Python version.
fi: Tässä Python-versiossa funktiomäärittelyissä ei voi olla symbolia `/`.

source: This symbol can only be used with Python versions 3.8.0 or newer. You are using Python version {version}.
fi: Tätä symbolia voi käyttää vain Python-versioiden 3.8.0 tai uudempien kanssa. Käytät Python-versiota {version}.

source: You have unspecified keyword arguments that appear before the symbol `/`.
fi: Sinulla on määrittelemättömiä avainsana-argumentteja, jotka esiintyvät ennen symbolia `/`.

source: Keyword arguments must appear after the `/` symbol.
fi: Avainsana-argumenttien on oltava `/`-symbolin jälkeen.

source: However, `*` indicates that the arguments that follow must be keyword arguments. When they are used together, `/` must appear before `*`.
fi: Kuitenkin `*` osoittaa, että seuraavien argumenttien on oltava avainsana-argumentteja. Kun niitä käytetään yhdessä, `/` on oltava ennen `*`.

source: `*` must appear after `/` in a function definition.
fi: `*` on oltava funktiomäärittelyssä `/`:n jälkeen.

source: `*{name}` must appear after `/` in a function definition.
fi: `*{name}`:n on oltava funktion määrittelyssä `/` jälkeen.

source: You can only use `/` once in a function definition.
fi: Voit käyttää `/` vain kerran funktion määritelmässä.

source: You can only use `*` once in a function definition.
fi: Voit käyttää `*` vain kerran funktion määritelmässä.

source: You have used it twice, with `*{first}` and `*{second}`.
fi: Olet käyttänyt sitä kahdesti, `*{first}` ja `*{second}` kanssa.

source: It must either be used by itself, `*`, or in the form `*{args}`, but not both.
fi: Sitä on käytettävä joko yksinään, `*`, tai muodossa `*{args}`, mutta ei molempia.

source: `*{args}` must appear before `**{kwargs}`.
fi: `*{args}` on oltava ennen `**{kwargs}`.

source: `**{kwargs}` must appear after the `*` operator.
fi: `**{kwargs}` on oltava `*`-operaattorin jälkeen.

source: You cannot use numbers as function arguments.
fi: Numeroita ei voi käyttää funktion argumentteina.

source: You used a number as an argument when defining a function. You can only use identifiers (variable names) as function arguments.
fi: Käytit numeroa argumenttina funktiota määritettäessä. Voit käyttää funktion argumentteina vain tunnuksia (muuttujien nimiä).

source: You cannot use strings as function arguments.
fi: Et voi käyttää merkkijonoja funktion argumentteina.

source: You used a string as an argument when defining a function. You can only use identifiers (variable names) as function arguments.
fi: Käytit merkkijonoa argumenttina funktiota määrittäessäsi. Voit käyttää funktion argumentteina vain tunnuksia (muuttujien nimiä).

source: You cannot have explicit tuples as function arguments.
fi: Funktion argumentteina ei voi olla eksplisiittisiä tupleja.

source: You can only use identifiers (variable names) as function arguments. Assign any tuple to a parameter and unpack it within the body of the function.
fi: Voit käyttää funktion argumentteina vain tunnuksia (muuttujien nimiä). Määritä mikä tahansa tuple parametriksi ja purkaa se funktion rungossa.

source: You cannot have explicit lists as function arguments.
fi: Funktioiden argumentteina ei voi olla eksplisiittisiä luetteloita.

source: You can only use identifiers (variable names) as function arguments.
fi: Voit käyttää funktion argumentteina vain tunnuksia (muuttujien nimiä).

source: You cannot have any explicit dict or set as function arguments.
fi: Funktion argumentteina ei voi olla mitään nimenomaisia dict- tai set-olioita.

source: You cannot have operators as function arguments.
fi: Operaattoreita ei voi käyttää funktion argumentteina.

source: I suspect you made a typo and wrote `{op}` instead of a comma. The following statement contains no syntax error: {new_statement}
fi: Epäilen, että olet tehnyt kirjoitusvirheen ja kirjoittanut `{op}` pilkun sijasta. Seuraava lauseke ei sisällä syntaksivirhettä: {new_statement}

source: Did you mean to write an equal sign?
fi: Tarkoititko kirjoittaa yhtäläisyysmerkin?

source: I suspect you made a typo and wrote `{op}` instead of an equal sign. The following statement contains no syntax error: {new_statement}
fi: Epäilen, että teit kirjoitusvirheen ja kirjoitit `{op}` yhtäläisyysmerkin sijasta. Seuraava lauseke ei sisällä syntaksivirhettä: {new_statement}

source: Did you mean to write `{op}`?
fi: Tarkoititko kirjoittaa `{op}`?

source: I suspect you made a typo and added `{op}` by mistake. The following statement contains no syntax error: {new_statement}
fi: Epäilen, että olet tehnyt kirjoitusvirheen ja lisännyt `{op}` vahingossa. Seuraava lauseke ei sisällä syntaksivirhettä: {new_statement}

source: You cannot use `{op}` as an argument.
fi: Et voi käyttää `{op}` argumenttina.

source: I suspect you made a typo and wrote `{op}` by mistake. If you replace it by a unique variable name, the result will contain no syntax error.
fi: Epäilen, että olet tehnyt kirjoitusvirheen ja kirjoittanut `{op}` vahingossa. Jos korvaat sen yksilöllisellä muuttujan nimellä, tulos ei sisällä syntaksivirhettä.

source: I suspect you made a typo and wrote `{op}` by mistake, perhaps instead of writing an identifier (variable name).
fi: Epäilen, että olet tehnyt kirjoitusvirheen ja kirjoittanut `{op}` vahingossa, ehkä sen sijaan, että olisit kirjoittanut tunnisteen (muuttujan nimen).

source: The `**` operator needs to be followed by an identifier (variable name).
fi: `**`-operaattorin jälkeen on oltava tunniste (muuttujan nimi).

source: Positional arguments must come before keyword arguments.
fi: Paikka-argumenttien on tultava ennen avainsana-argumentteja.

source: `{arg}` is a positional argument that appears after one or more keyword arguments in your function definition.
fi: `{arg}` on sijaisargumentti, joka esiintyy yhden tai useamman avainsana-argumentin jälkeen funktiomäärittelyssäsi.

source: Line `{number}` identified above is more indented than expected.
fi: Edellä mainittu rivi `{number}` on odotettua enemmän sisennetty.

source: Line `{number}` identified above was expected to begin a new indented block.
fi: Yllä mainitun rivin `{number}` odotettiin aloittavan uuden sisennyslohkon.

source: Line `{number}` identified above is less indented than expected.
fi: Edellä mainittu rivi `{number}` on vähemmän sisennetty kuin odotettiin.

source: However, line {number}, which is identified as having a problem, consists of a single string which is also the case for the preceding line. Perhaps you meant to include a continuation character, `\`, at the end of line {preceding}.
fi: Rivi {number}, jossa on ongelma, koostuu kuitenkin yhdestä merkkijonosta, mikä pätee myös edeltävään riviin. Ehkä sinun oli tarkoitus lisätä jatkomerkki `\` rivin {preceding} loppuun.

source: You can only assign objects to identifiers (variable names).
fi: Voit määrittää objekteja vain tunnisteille (muuttujien nimille).

source: You can only delete names of objects, or items in mutable containers such as `list`, `set`, or `dict`.
fi: Voit poistaa vain objektien nimiä tai muuttuvien säiliöiden, kuten `list`, `set` tai `dict`, kohteita.

source: of type `int`
fi: tyyppi `int`

source: of type `complex`
fi: tyypiltään `kompleksi`

source: of type `float`
fi: tyyppi `float`

source: of type `str`
fi: tyyppi `str`

source: of type `dict`
fi: tyyppi `dict`

source: of type `list`
fi: tyyppi `list`

source: of type `set`
fi: jonka tyyppi on `set`

source: of type `tuple`
fi: tyyppi `tuple`

source: Did you mean `{num}`?
fi: Tarkoititko `{num}`?

source: Perhaps you meant to write the octal number `{num}` and forgot the letter 'o', or perhaps you meant to write a decimal integer and did not know that it could not start with zeros.
fi: Ehkä sinun oli tarkoitus kirjoittaa oktaaliluku `{num}` ja unohdit o-kirjaimen, tai ehkä sinun oli tarkoitus kirjoittaa desimaalinen kokonaisluku etkä tiennyt, että se ei voi alkaa nollilla.

source: Perhaps you meant to write the integer `{num}` and did not know that it could not start with zeros.
fi: Ehkä sinun oli tarkoitus kirjoittaa kokonaisluku `{num}` etkä tiennyt, että se ei voi alkaa nollilla.

source: On the left-hand side of an equal sign, you have a conditional expression instead of the name of a variable. A conditional expression has the following form: variable = object if condition else other_object
fi: Yhtäläisyysmerkin vasemmalla puolella on muuttujan nimen sijasta ehdollinen lauseke. Ehdollinen lauseke on seuraavanlainen: muuttuja = objekti if ehto else muu_objekti

source: On the left-hand side of an equal sign, you have a conditional expression instead of the name of a variable. {expression} = ... {mark}
fi: Yhtäläisyysmerkin vasemmalla puolella on muuttujan nimen sijasta ehdollinen lauseke. {expression} = ... {mark}

source: On the left-hand side of an equal sign, you have an expression instead of the name of a variable.
fi: Yhtäläisyysmerkin vasemmalla puolella on muuttujan nimen sijasta lauseke.

source: You wrote the expression {fn_call} = ... where `{fn_call}`, on the left-hand side of the equal sign, either is or includes a function call and is not simply the name of a variable.
fi: Kirjoitit lausekkeen {fn_call} = ..., jossa `{fn_call}`, joka on yhtäläisyysmerkin vasemmalla puolella, on joko funktiokutsu tai sisältää sen eikä ole vain muuttujan nimi.

source: You wrote the expression {fn_call} = ... {mark} where `{fn_call}`, on the left-hand side of the equal sign, either is or includes a function call and is not simply the name of a variable.
fi: Kirjoitit lausekkeen {fn_call} = ... {mark}, jossa `{fn_call}`, joka on yhtäläisyysmerkin vasemmalla puolella, on joko funktiokutsu tai sisältää sen eikä ole vain muuttujan nimi.

source: On the left-hand side of an equal sign, you have a generator expression instead of the name of a variable.
fi: Yhtäläisyysmerkin vasemmalla puolella on muuttujan nimen sijasta generaattorilauseke.

source: You wrote an expression that has the f-string `{fstring}` on the left-hand side of the equal sign. An f-string should only appear on the right-hand side of an equal sign.
fi: Kirjoitit lausekkeen, jossa f-string `{fstring}` on yhtäsuuruusmerkin vasemmalla puolella. f-string pitäisi olla vain yhtäsuuruusmerkin oikealla puolella.

source: You cannot assign a value to `{keyword}`.
fi: Et voi antaa arvoa `{keyword}`.

source: You cannot assign a value to the ellipsis symbol [`...`].
fi: Ellipsisymbolille [`...`] ei voi antaa arvoa.

source: The ellipsis symbol `...` is a constant in Python;you cannot assign it a different value.
fi: Ellipsisymboli `...` on Pythonissa vakio; et voi antaa sille eri arvoa.

source: `{keyword}` is a constant in Python; you cannot assign it a different value.
fi: `{keyword}` on Pythonissa vakio; et voi antaa sille eri arvoa.

source: You were trying to assign a value to the Python keyword `{keyword}`. This is not allowed.
fi: Yritit antaa arvon Pythonin avainsanalle `{keyword}`. Tämä ei ole sallittua.

source: A for loop must have the form: for ... in sequence: where `...` must contain only identifiers (variable names) and not literals like `{bad_token}`.
fi: For-silmukan on oltava muotoa: for ... in sequence: jossa `...` saa sisältää vain tunnisteita (muuttujien nimiä) eikä kirjaimia kuten `{bad_token}`.

source: variable_name
fi: muuttuja_nimi

source: Perhaps you meant to write: {name} = {literal}
fi: Ehkä sinun piti kirjoittaa: {name} = {literal}.

source: Perhaps you meant to write `{name} = {literal}`
fi: Ehkä sinun piti kirjoittaa `{name} = {literal}`

source: You wrote an expression like {literal} = {name} where `{literal}`, on the left-hand side of the equal sign, is or includes an actual object {of_type} and is not simply the name of a variable.
fi: Kirjoitit lausekkeen {literal} = {name}, jossa `{literal}`, yhtäläisyysmerkin vasemmalla puolella, on tai sisältää todellisen objektin {of_type} eikä ole vain muuttujan nimi.

source: It is possible that you used an equal sign `=` instead of a colon `:` to assign values to keys in a dict.
fi: On mahdollista, että olet käyttänyt yhtäläisyysmerkkiä `=` kaksoispisteen `:` sijasta antaaksesi arvoja dictin avaimille.
