Repository: raikasdev/koodieditori
Catalog: src/workers/python/*/friendly_tb_*.po
Languages: fi

source: You can only use a `yield` statement inside a function.
fi: Voit käyttää `yield`-lauseketta vain funktion sisällä.

source: This is a message that was added in Python 3.9 to prevent redefining `__peg_parser__`. It should not be present in other versions.
fi: Tämä on viesti, joka lisättiin Python 3.9:ssä estämään `__peg_parser__`:n uudelleenmäärittelyn. Sen ei pitäisi esiintyä muissa versioissa.

source: Friendly-traceback cannot identify the non-printable character. This should not happen. Please report this case
fi: Friendly-traceback ei pysty tunnistamaan ei-tulostettavaa merkkiä. Tämän ei pitäisi tapahtua. Ilmoita tästä tapauksesta

source: Your code contains the invalid non-printable character {char}.
fi: Koodisi sisältää virheellisen ei-tulostettavan merkin {char}.

source: Did you mean `from {module} import {function}`?
fi: Tarkoititko `from {module} import {function}`?

source: You wrote something like import {function} from {module} instead of from {module} import {function}
fi: Kirjoitit jotain kuten import {function} from {module} eikä from {module} import {function}.

source: The statement `{line}` is not valid.
fi: Lauseke `{line}` ei ole kelvollinen.

source: I don't have any additional information
fi: Minulla ei ole lisätietoja

source: Did you forget to add an index?
fi: Unohditko lisätä indeksin?

source: It looks like you forgot to add an index. Perhaps you meant to write something like: {new_line}
fi: Näyttää siltä, että unohdit lisätä indeksin. Ehkä sinun piti kirjoittaa jotakin seuraavanlaista: {new_line}

source: The closing {bracket} on line {close_lineno} does not match the opening {open_bracket} on line {open_lineno}.
fi: Rivin {close_lineno} sulkeva {bracket} ei vastaa rivin {open_bracket} avaavaa {open_lineno}.

source: Did you mean to write `...`?
fi: Tarkoititko kirjoittaa `...`?

source: It looks like you meant to write `...` but added an extra `.` by mistake.
fi: Näyttää siltä, että sinun piti kirjoittaa `...` mutta lisäsit vahingossa ylimääräisen `.`.

source: It looks like you copy-pasted code from an interactive interpreter. The Python prompt, `>>>`, should not be included in your code.
fi: Näyttää siltä, että kopioit koodia interaktiivisesta tulkista. Python-kehotetta, `>>>>`, ei pitäisi sisällyttää koodiisi.

source: It looks like you copy-pasted code from an interactive interpreter. The Python prompt, `...`, should not be included in your code.
fi: Näyttää siltä, että kopioit koodia interaktiivisesta tulkista. Python-kehotetta, `...`, ei pitäisi sisällyttää koodiisi.

source: You should not use the backquote character.
fi: Takaviivamerkkiä ei pidä käyttää.

source: You are using the backquote character. Either you meant to write a single quote, ', or copied Python 2 code; in this latter case, use the function `repr(x)`.
fi: Käytät takaviivamerkkiä. Tarkoitit joko kirjoittaa yksinkertaisen lainausmerkin, ', tai kopioit Python 2 -koodia; jälkimmäisessä tapauksessa käytä funktiota `repr(x)`.

source: You forgot to add a condition.
fi: Unohdit lisätä ehdon.

source: An `if` statement requires a condition: if condition: ...
fi: Jos-lause vaatii ehdon: if ehto: ...

source: A `while` loop requires a condition: while condition: ...
fi: While-silmukka vaatii ehdon: while ehto: ...

source: A `for` loop requires at least 3 more terms.
fi: For-silmukka vaatii vähintään 3 muuta termiä.

source: A `for` loop is an iteration over a sequence: for element in sequence: ...
fi: For-silmukka on sarjan iterointi: for element in sequence: ...

source: A class needs a name.
fi: Luokka tarvitsee nimen.

source: A `class` statement requires a name: class SomeName: ...
fi: `class`-lause vaatii nimen: class SomeName: ...

source: You cannot use the Python keyword `{word}` as an attribute.
fi: Pythonin avainsanaa `{word}` ei voi käyttää attribuuttina.

source: `{word}` cannot be used as an attribute.
fi: `{word}` ei voi käyttää attribuuttina.

source: Perhaps you meant to write `elif`.
fi: Ehkä sinun piti kirjoittaa `elif`.

source: You likely meant to use Python's `elif` keyword but wrote `{name}` instead.
fi: Tarkoituksenasi oli todennäköisesti käyttää Pythonin `elif`-avainsanaa, mutta kirjoitit sen sijaan `{name}`.

source: The augmented assignment operator is not allowed in Python version {version}.
fi: Lisätty osoitusoperaattori ei ole sallittu Python-versiossa {version}.

source: You appear to be using the operator `:=`, sometimes called the walrus operator. This operator requires the use of Python 3.8 or newer. You are using version {version}.
fi: Näyttää siltä, että käytät operaattoria `:=`, jota kutsutaan joskus mursuoperaattoriksi. Tämä operaattori edellyttää Python 3.8:n tai uudemman version käyttöä. Käytät versiota {version}.

source: Did you write operators in an incorrect order?
fi: Kirjoititko operaattorit väärässä järjestyksessä?

source: It looks like you wrote two operators (`{first}` and `{second}`) in the wrong order: `{wrong}` instead of `{correct}`.
fi: Näyttää siltä, että kirjoitit kaksi operaattoria (`{first}` ja `{second}`) väärässä järjestyksessä: `{wrong}` eikä `{correct}`.

source: You wrote three equal signs in a row which is allowed in some programming languages, but not in Python. To check if two objects are equal, use two equal signs, `==`; to see if two names represent the exact same object, use the operator `is`.
fi: Kirjoitit kolme yhtäsuuruusmerkkiä peräkkäin, mikä on sallittua joissakin ohjelmointikielissä, mutta ei Pythonissa. Jos haluat tarkistaa, ovatko kaksi objektia yhtä suuret, käytä kahta yhtäläisyysmerkkiä, `==`; jos haluat tarkistaa, edustavatko kaksi nimeä täsmälleen samaa objektia, käytä operaattoria `is`.

source: Did you mean to use `is` instead of `===`?
fi: Tarkoititko käyttää `is` eikä `===`?

source: You cannot have write the same operator, `{op}`, twice in a row. Perhaps you wrote one of them by mistake or forgot to write something between them.
fi: Et voi kirjoittaa samaa operaattoria, `{op}`, kahdesti peräkkäin. Ehkä kirjoitit toisen niistä vahingossa tai unohdit kirjoittaa jotain niiden väliin.

source: You cannot have these two operators, `{first}` and `{second}`, following each other. It looks like you tried to use a starred expression as a dict value; this is not allowed.
fi: Nämä kaksi operaattoria, `{first}` ja `{second}`, eivät voi seurata toisiaan. Näyttää siltä, että olet yrittänyt käyttää tähdellä varustettua lauseketta dict-arvona; tämä ei ole sallittua.

source: You cannot have these two operators, `{first}` and `{second}`, following each other. Perhaps you wrote one of them by mistake or forgot to write something between them.
fi: Nämä kaksi operaattoria, `{first}` ja `{second}`, eivät voi seurata toisiaan. Ehkä kirjoitit toisen niistä vahingossa tai unohdit kirjoittaa jotain niiden väliin.

source: Or perhaps you included a space by mistake between the two operators and meant to write `{oper}` as a single operator.
fi: Tai ehkä lisäsit vahingossa välilyönnin kahden operaattorin väliin ja tarkoituksesi oli kirjoittaa `{oper}` yhtenä operaattorina.

source: Did you mean to use `=`?
fi: Tarkoititko käyttää `=`?

source: You use the augmented assignment operator `:=` where the normal assignment operator `=` was required.
fi: Käytät laajennettua osoitusoperaattoria `:=` siinä missä normaali osoitusoperaattori `=` oli tarpeen.

source: The following statement would not contain a syntax error: {new_statement}
fi: Seuraava lauseke ei sisällä syntaksivirhettä: {new_statement}.

source: Perhaps you needed `==` or `:=` instead of `=`.
fi: Ehkä tarvitsit `==` tai `:=` `=`:n sijasta.

source: You used an assignment operator `=`; perhaps you meant to use an equality operator, `==`, or the walrus operator `:=`.
fi: Käytit osoitusoperaattoria `=`; ehkä sinun piti käyttää tasa-arvooperaattoria `==` tai mursuoperaattoria `:=`.

source: It looks as if you are attempting to use pip to install a module. `pip` is a command that needs to run in a terminal, not from a Python interpreter.
fi: Näyttää siltä, että yrität käyttää pipiä moduulin asentamiseen. `pip` on komento, joka on ajettava päätelaitteessa, ei Python-tulkista.

source: Pip cannot be used in a Python interpreter.
fi: Pipiä ei voi käyttää Python-tulkissa.

source: I am guessing that you are attempting to use Python to run a program. You must do so from a terminal and not from a Python interpreter.
fi: Arvelen, että yrität käyttää Pythonia ohjelman suorittamiseen. Sinun on tehtävä se terminaalista eikä Python-tulkista.

source: You cannot have a dot `.` followed by `{bracket}`.
fi: Pistettä `.` ei voi seurata `{bracket}`.

source: Perhaps you need to replace the dot by a comma.
fi: Ehkä sinun on korvattava piste pilkulla.

source: It looks like you are trying to raise an exception using Python 2 syntax.
fi: Näyttää siltä, että yrität herättää virheen Python 2 -syntaksilla.

source: Did you forget a colon `:`?
fi: Unohditko kaksoispisteen `:`?

source: You wrote a `{for_while}` loop but forgot to add a colon `:` at the end
fi: Kirjoitit `{for_while}`-silmukan, mutta unohdit lisätä kaksoispisteen `:` loppuun.

source: You wrote a statement beginning with `{name}` but forgot to add a colon `:` at the end.
fi: Kirjoitit lausekkeen, joka alkaa `{name}`, mutta unohdit lisätä kaksoispisteen `:` loppuun.

source: You wrote a semicolon, `;`, where a comma was expected.
fi: Kirjoitit puolipisteen `;`, kun odotettiin pilkkua.

source: You wrote semicolons, `;`, where commas were expected.
fi: Kirjoitit puolipisteitä, `;`, kun odotettiin pilkkuja.

source: Did you mean to write commas?
fi: Tarkoititko kirjoittaa pilkut?

source: You wrote a semicolon, `;`, where a colon was expected.
fi: Kirjoitit puolipisteen `;`, kun odotettiin kaksoispistettä.

source: Did you mean to write a colon?
fi: Tarkoititko kirjoittaa kaksoispisteen?

source: Did you made a mistake in writing an hexadecimal integer?
fi: Teitkö virheen kirjoittaessasi heksadesimaalisen kokonaisluvun?

source: It looks like you used an invalid character (`{character}`) in an hexadecimal number. Hexadecimal numbers are base 16 integers that use the symbols `0` to `9` to represent values 0 to 9, and the letters `a` to `f` (or `A` to `F`) to represent values 10 to 15. In Python, hexadecimal numbers start with either `0x` or `0X`, followed by the characters used to represent the value of that integer.
fi: Näyttää siltä, että käytit virheellistä merkkiä (`{character}`) heksadesimaaliluvussa. Heksadesimaaliluvut ovat 16-alkuisia kokonaislukuja, joissa käytetään symboleja `0`-9` edustamaan arvoja 0-9 ja kirjaimia `a`-f` (tai `A`-F`) edustamaan arvoja 10-15. Pythonissa heksadesimaaliluvut alkavat joko `0x` tai `0X` -merkillä, jota seuraavat kyseisen kokonaisluvun arvon esittämiseen käytetyt merkit.

source: Did you made a mistake in writing an octal integer?
fi: Teitkö virheen kirjoittaessasi oktaalista kokonaislukua?

source: It looks like you used an invalid character (`{character}`) in an octal number. Octal numbers are base 8 integers that only use the symbols `0` to `7` to represent values. In Python, octal numbers start with either `0o` or `0O`, (the digit zero followed by the letter `o`) followed by the characters used to represent the value of that integer.
fi: Näyttää siltä, että olet käyttänyt virheellistä merkkiä (`{character}`) oktaaliluvussa. Oktaaliluvut ovat kokonaislukuja, jotka käyttävät vain symboleja `0` - `7` arvojen esittämiseen. Pythonissa oktaaliluvut alkavat joko `0o` tai `0O` -merkillä (numero nolla, jota seuraa kirjain `o`), jota seuraavat kyseisen kokonaisluvun arvon esittämiseen käytetyt merkit.

source: Valid names cannot begin with a number.
fi: Kelvolliset nimet eivät voi alkaa numerolla.

source: Did you mean `{number}j`?
fi: Tarkoititko `{number}j`?

source: Perhaps you thought that `i` could be used to represent the square root of `-1`. In Python, the symbol used for this is `j` and the complex part is written as `some_number` immediately followed by `j`, with no spaces in between. Perhaps you meant to write `{number}j`.
fi: Ehkä ajattelit, että `i` voitaisiin käyttää esittämään `-1`:n neliöjuurta. Pythonissa tähän käytetään symbolia `j`, ja kompleksinen osa kirjoitetaan muodossa `jokin_luku` välittömästi `j`:n jälkeen ilman välilyöntejä. Ehkä tarkoitit kirjoittaa `{number}j`.

source: Did you mean `{number}{second}0`?
fi: Tarkoititko `{number}{second}0`?

source: Perhaps you meant to write `{number}{second}0` in scientific notation and forgot the numerical value for the exponent.
fi: Ehkä sinun oli tarkoitus kirjoittaa `<{number}{second}0` tieteellisessä merkintätavassa ja unohdit eksponentin lukuarvon.

source: [Note: `{first} * {second}` would also be valid since `{first}` is a complex number.]
fi: [Huomautus: `{first} * {second}` olisi myös kelvollinen, koska `{first}` on kompleksiluku.]]

source: Perhaps you forgot a multiplication operator, `{first} * {second}`.
fi: Ehkä unohdit kertolaskuoperaattorin, `{first} * {second}`.

source: Your Python version does not support this f-string feature.
fi: Python-versiosi ei tue tätä f-merkkijono-ominaisuutta.

source: You are likely using a 'debug' syntax of f-strings introduced in Python version 3.8. You are using version {version}.
fi: Käytät todennäköisesti f-merkkijonojen "debug"-syntaksia, joka otettiin käyttöön Pythonin versiossa 3.8. Käytät versiota {version}.

source: You are likely trying to assign a value within an f-string. This is not allowed.
fi: Yrität todennäköisesti antaa arvon f-merkkijonon sisällä. Tämä ei ole sallittua.

source: The content of your f-string is invalid. Please consult the documentation: https://docs.python.org/3/reference/lexical_analysis.html#f-strings
fi: F-merkkijonon sisältö on virheellinen. Tutustu dokumentaatioon: https://docs.python.org/3/reference/lexical_analysis.html#f-strings

source: Python keywords cannot be used as identifiers (variable names).
fi: Python-avainsanoja ei voi käyttää tunnisteina (muuttujien niminä).

source: `lambda` does not allow parentheses around its arguments. This was allowed in Python 2 but it not allowed in Python 3.
fi: `lambda` ei salli sulkuja argumenttiensa ympärillä. Tämä oli sallittua Python 2:ssa, mutta ei enää Python 3:ssa.

source: You cannot have explicit tuples as arguments. Assign any tuple to a parameter and unpack it within the body of the function.
fi: Argumentteina ei voi olla eksplisiittisiä tupleja. Määritä mikä tahansa tuple parametriksi ja purkaa se funktion rungossa.

source: If you remove `{type_decl}`, you will have a valid Python statement.
fi: Jos poistat `{type_decl}`, saat kelvollisen Python-lauseen.

source: However, even if you remove `{type_decl}`, there would still be some some syntax errors.
fi: Vaikka poistaisit `{type_decl}`, syntaksivirheitä olisi silti joitakin.

source: You do not need to declare variables in Python.
fi: Muuttujia ei tarvitse ilmoittaa Pythonissa.

source: It looks like you were trying to declare that `{var}` was a variable using the word `{type_decl}`.
fi: Näyttää siltä, että yritit ilmoittaa, että `{var}` on muuttuja käyttäen sanaa `{type_decl}`.

source: I am guessing that you forgot a comma between two strings when defining a dict.
fi: Oletan, että unohdit pilkun kahden merkkijonon väliin, kun määrittelit diktiä.

source: Did you forget to write `in`?
fi: Unohditko kirjoittaa "in"?

source: It looks as though you forgot to use the keyword `in` as part of a `for` statement. Perhaps you meant: {new_statement}
fi: Näyttää siltä, että unohdit käyttää avainsanaa `in` osana `for`-lauseen osana. Ehkä tarkoitit: {new_statement}

source: Did you forget to write parenthesis?
fi: Unohditko kirjoittaa sulkeet?

source: It looks as though you forgot to use to use parenthesis with `range`. Perhaps you meant: {new_statement}
fi: Näyttää siltä, että olet unohtanut käyttää sulkuja `range`:n kanssa. Ehkä tarkoitit: {new_statement}.

source: Perhaps you meant to write `{keyword}` and made a typo. The correct line might be `{line}`
fi: Ehkä sinun piti kirjoittaa `{keyword}` ja teit kirjoitusvirheen. Oikea rivi voisi olla `{line}`.

source: I am guessing that you were writing a comprehension or a generator expression and use the wrong order for a condition. The correct order depends if there is an `else` clause or not. For example, the correct order for a list comprehensions with condition can be either [f(x) if condition else other for x in sequence] # 'if' before 'for' or, if there is no `else` [f(x) for x in sequence if condition] # 'if' after 'for'
fi: Arvelen, että kirjoitit ymmärrystä tai generaattorilauseketta ja käytit väärää järjestystä ehdolle. Oikea järjestys riippuu siitä, onko `else`-lauseketta vai ei. Esimerkiksi oikea järjestys listan ymmärrystä varten, jossa on ehto, voi olla joko [f(x) if condition else other for x in sequence] # 'if' ennen 'for'-lauseketta, tai jos `else`-lauseketta ei ole [f(x) for x in sequence if condition] # 'if' for'-lausekkeen jälkeen.

source: You cannot have spaces in identifiers (variable names). Perhaps you meant `{name}`?
fi: Tunnisteissa (muuttujien nimissä) ei voi olla välilyöntejä. Ehkä tarkoitit `{name}`?

source: `bf` is an illegal string prefix.
fi: `bf` on laiton merkkijonon etuliite.

source: I am guessing that you wanted a binary f-string; this is not allowed.
fi: Oletan, että halusit binäärisen f-merkkijonon; tämä ei ole sallittua.

source: It is possible that you forgot a comma between items in a tuple, or between function arguments, at the position indicated by ^.
fi: On mahdollista, että olet unohtanut pilkun tuplen kohtien tai funktion argumenttien väliin ^:llä osoitetussa kohdassa.

source: It is possible that you forgot a comma between items in a list at the position indicated by ^.
fi: On mahdollista, että olet unohtanut pilkun luettelon kohtien väliin ^-kirjaimella osoitetussa kohdassa.

source: It is possible that you forgot a comma between items in a set or dict at the position indicated by ^.
fi: On mahdollista, että olet unohtanut pilkun joukon tai diktion kohtien väliin ^:llä merkittyyn kohtaan.

source: Python indicates that the error is caused by `{second}` written immediately after `{first}`.
fi: Python osoittaa, että virhe johtuu siitä, että `{second}` on kirjoitettu heti `{first}` jälkeen.

source: Perhaps you meant{line}
fi: Ehkä tarkoitit{line}

source: Did you forget something between `{first}` and `{second}`?
fi: Unohditko jotain `{first}` ja `{second}` välistä?

source: Perhaps you meant to insert an operator like `{operators}` between `{first}` and `{second}`. The following lines of code would not cause any `SyntaxError`:
fi: Ehkä tarkoitit lisätä operaattorin `{operators}` tyyppisen operaattorin `{first}` ja `{second}` väliin. Seuraavat koodirivit eivät aiheuta mitään `SyntaxError`-virhettä:

source: Note: these are just some of the possible choices and that some of them might raise other types of exceptions.
fi: Huomaa: nämä ovat vain osa mahdollisista vaihtoehdoista, ja jotkin niistä saattavat aiheuttaa muunlaisia virheitä.

source: There is an additional possibility.
fi: On vielä yksi mahdollisuus.

source: It is possible that you used an equal sign `=` instead of a colon `:` to assign values to keys in a dict before or at the position indicated by ^.
fi: On mahdollista, että olet käyttänyt yhtäläisyysmerkkiä `=` kaksoispisteen `:` sijasta antaaksesi arvoja dictin avaimille ennen ^:n osoittamaa kohtaa tai sen kohdalla.

source: The Python keyword `{boolean}` can only be used for boolean expressions. Perhaps you meant to write `{new_statement}`
fi: Pythonin avainsanaa `{boolean}` voidaan käyttää vain boolean-lausekkeissa. Ehkä tarkoitit kirjoittaa `{new_statement}`.

source: I am guessing that you are trying to import at least one object from module `{module}` and rename it using the Python keyword `as`; this keyword can only be used to rename one object at a time using a well defined syntax. I suggest that you split up any such import statement with each object renamed on a separate line as follows: from {module} import object_1 as name_1 from {module} import object_2 as name_2 # if needed
fi: Arvelen, että yrität tuoda ainakin yhden objektin moduulista `{module}` ja nimetä sen uudelleen Pythonin avainsanalla `as`; tätä avainsanaa voidaan käyttää vain yhden objektin uudelleen nimeämiseen kerrallaan käyttäen tarkoin määriteltyä syntaksia. Ehdotan, että jaat tällaisen tuontilausekkeen, jossa jokainen uudelleen nimetty objekti on erillisellä rivillä, seuraavasti: from {module} import object_1 as name_1 from {module} import object_2 as name_2 # jos tarpeen.

source: I am guessing that you wrote {bad_token} twice in a row by mistake. If that is the case, you need to remove the second one.
fi: Oletan, että kirjoitit {bad_token} vahingossa kaksi kertaa peräkkäin. Jos näin on, sinun on poistettava toinen.

source: Did you write {bad_token} twice by mistake?
fi: Kirjoititko vahingossa {bad_token} kahdesti?

source: I am guessing that you wrote {bad_token} by mistake. Removing it and writing `{line}` seems to fix the error.
fi: Oletan, että kirjoitit {bad_token} vahingossa. Sen poistaminen ja kirjoittaminen `{line}` näyttää korjaavan virheen.

source: Did you write {bad_token} by mistake?
fi: Kirjoititko {bad_token} vahingossa?

source: It looks like the error occurred as you were writing a Python dict. Perhaps wrote a dict key without writing the corresponding value.
fi: Näyttää siltä, että virhe tapahtui, kun kirjoitit Python dict:tä. Ehkä kirjoitit dict-avaimen kirjoittamatta vastaavaa arvoa.

source: The `else` keyword does not begin a code block that matches a valid code block, possibly because `else` is not indented correctly.
fi: Avainsana `else` ei aloita koodilohkoa, joka vastaa kelvollista koodilohkoa, mahdollisesti siksi, että `else` ei ole oikein sisennetty.

source: The `elif` keyword does not begin a code block that matches an `if` block, possibly because `elif` is not indented correctly.
fi: Avainsana `elif` ei aloita koodilohkoa, joka vastaa `if`-lohkoa, mahdollisesti siksi, että `elif` ei ole oikein sisennetty.

source: The `except` keyword does not begin a code block that matches a `try` block, possibly because `except` is not indented correctly.
fi: Avainsana `except` ei aloita koodilohkoa, joka vastaa `try`-lohkoa, mahdollisesti siksi, että `except` ei ole oikein sisennetty.

source: The `finally` keyword does not begin a code block that matches a `try` block, possibly because `finally` is not indented correctly.
fi: Avainsana `finally` ei aloita koodilohkoa, joka vastaa `try`-lohkoa, mahdollisesti siksi, että `finally` ei ole oikein sisennetty.

source: You used square brackets, `[...]` instead of parentheses.
fi: Käytit hakasulkeita, `[...]`, sulkeiden sijasta.

source: Write the following instead: {new_statement}
fi: Kirjoita sen sijaan seuraava: {new_statement}

source: The opening {bracket} on line {linenumber} is not closed.
fi: Rivin {linenumber} aukeava {bracket} ei ole suljettu.

source: If this is incorrect, please report this case.
fi: Jos tämä ei pidä paikkaansa, ilmoita tästä tapauksesta.

source: Perhaps you wrote a statement beginning a code block intended to be part of a generator expression. You cannot have separate code blocks inside generator expressions.
fi: Ehkä kirjoitit lausekkeen, joka aloittaa koodilohkon, joka on tarkoitettu osaksi generaattorilauseketta. Generaattorilausekkeiden sisällä ei voi olla erillisiä koodilohkoja.

source: Perhaps you wrote a statement beginning a code block intended to be part of a list comprehension. You cannot have separate code blocks inside list comprehensions.
fi: Ehkä kirjoitit lausekkeen, joka aloittaa koodilohkon, jonka on tarkoitus olla osa listan ymmärtämistä. Listojen ymmärtämisen sisällä ei voi olla erillisiä koodilohkoja.
