Repository: raikasdev/koodieditori
Catalog: src/workers/python/*/friendly_tb_*.po
Languages: fi

source: Perhaps you need to double the backslash characters.
fi: Ehkä sinun on kaksinkertaistettava backslash-merkit.

source: I suspect that you wrote a filename or path that contains at least one backslash character, `\`. Python likely interpreted this as indicating the beginning of what is known as an escape sequence. To solve the problem, either write a so-called 'raw string' by adding the letter `r` as a prefix in front of the filename or path, or replace all single backslash characters, `\`, by double ones: `\\`.
fi: Epäilen, että kirjoitit tiedostonimen tai polun, joka sisältää ainakin yhden backslash-merkin, `\`. Python todennäköisesti tulkitsi tämän osoittavan niin sanotun escape-sekvenssin alkua. Voit ratkaista ongelman joko kirjoittamalla niin sanotun "raakamerkin" lisäämällä kirjaimen `r` etuliitteeksi tiedostonimen tai polun eteen tai korvaamalla kaikki yksittäiset backslash-merkit, `\`, kaksoismerkeillä: `\\`.

source: While you were iterating over the items of `{name}` ({container_type}) in a `{for_while}` loop, you either tried to add or remove items from it. Suggestion: start by making a copy of `{name}` and iterate over the items of that copy if you want to change `{name}` inside a loop. You might want to do this as follows: my_{name} = {name}.copy() for item in my_{name}: # Change {name}
fi: Kun iteroit `{name}`:n ({container_type}) kohteita silmukassa `{for_while}`, yritit joko lisätä tai poistaa kohteita siitä. Ehdotus: aloita tekemällä kopio `{name}`:sta ja iteroi tämän kopion kohteita, jos haluat muuttaa `{name}`:a silmukan sisällä. Voit tehdä tämän seuraavasti: my_{name} = {name}.copy() for item in my_{name}: # Muuta {name}.

source: While you were iterating over the items of a container ({container_type}) in a `{for_while}` loop, you either tried to add or remove items from it. Suggestion: start by making a copy of the container and iterate over the items of that copy if you want to change that container inside a loop.
fi: Kun iteroit säiliön ({container_type}) kohteita silmukassa `{for_while}`, yritit joko lisätä tai poistaa kohteita säiliöstä. Ehdotus: aloita tekemällä kopio säiliöstä ja iteroi kopion kohteita, jos haluat muuttaa säiliötä silmukan sisällä.

source: Did you forget to convert the string `{name}` into {number_type}?
fi: Unohditko muuntaa merkkijonon `{name}` muotoon {number_type}?

source: Perhaps you forgot to convert the string `{name}` into {number_type}.
fi: Ehkä unohdit muuntaa merkkijonon `{name}` muotoon {number_type}.

source: You cannot use complex numbers with the modulo operator `%`.
fi: Et voi käyttää kompleksilukuja modulo-operaattorin `%` kanssa.

source: The arguments of `divmod` must be integers (`int`) or real (`float`) numbers.
fi: Argumenttien `divmod` on oltava kokonaislukuja (`int`) tai reaalilukuja (`float`).

source: At least one of the arguments was a complex number.
fi: Ainakin yksi argumenteista oli kompleksiluku.

source: The second argument of the function `getattr()` must be a string.
fi: Funktion `getattr()` toisen argumentin on oltava merkkijono.

source: The second argument of the function `hasattr()` must be a string.
fi: Funktion `hasattr()` toisen argumentin on oltava merkkijono.

source: Some attribute of a function you called is expected to be a string.
fi: Jonkin kutsumasi funktion attribuutin odotetaan olevan merkkijono.

source: You tried to concatenate (add) two different types of objects: {first} and {second}.
fi: Yritit ketjuttaa (lisätä) kaksi erityyppistä objektia: {first} ja {second}.

source: You tried to add two incompatible types of objects: {first} and {second}.
fi: Yritit lisätä kaksi yhteensopimatonta objektityyppiä: {first} ja {second}.

source: You tried to subtract two incompatible types of objects: {first} and {second}.
fi: Yritit vähentää kaksi yhteensopimatonta objektityyppiä: {first} ja {second}.

source: You tried to multiply two incompatible types of objects: {first} and {second}.
fi: Yritit kertoa kaksi yhteensopimatonta objektityyppiä: {first} ja {second}.

source: You tried to divide two incompatible types of objects: {first} and {second}.
fi: Yritit jakaa kaksi yhteensopimatonta objektityyppiä: {first} ja {second}.

source: You tried to perform the bitwise operation {operator} on two incompatible types of objects: {first} and {second}.
fi: Yritit suorittaa bittioperaation {operator} kahdelle yhteensopimattomalle objektityypille: {first} ja {second}.

source: Did you mean `{line}`?
fi: Tarkoititko `{line}`?

source: Outside of Python, `^` is often used to indicate exponentiation.
fi: Pythonin ulkopuolella `^` käytetään usein osoittamaan eksponentointia.

source: Perhaps you meant `{line}`.
fi: Ehkä tarkoitit `{line}`.

source: You tried to perform the bit shifting operation {operator} on two incompatible types of objects: {first} and {second}.
fi: Yritit suorittaa bittisiirto-operaation {operator} kahdelle yhteensopimattomalle objektityypille: {first} ja {second}.

source: You tried to exponentiate (raise to a power) using two incompatible types of objects: {first} and {second}.
fi: Yritit potensoida (korottaa potenssiin) käyttämällä kahta yhteensopimatonta objektityyppiä: {first} ja {second}.

source: You tried to use the operator {operator} using two incompatible types of objects: {first} and {second}. This operator is normally used only for multiplication of matrices.
fi: Yritit käyttää operaattoria {operator} käyttäen kahta yhteensopimatonta objektityyppiä: {first} ja {second}. Tätä operaattoria käytetään yleensä vain matriisien kertomiseen.

source: Complex numbers cannot be ordered.
fi: Kompleksilukuja ei voi järjestää.

source: You tried to do an order comparison ({operator}) between two complex numbers.
fi: Yritit tehdä järjestysvertailun ({operator}) kahden kompleksiluvun välillä.

source: You tried to do an order comparison ({operator}) between two incompatible types of objects: {first} and {second}.
fi: Yritit tehdä järjestysvertailun ({operator}) kahden yhteensopimattoman objektityypin välillä: {first} ja {second}.

source: `{iter}` is an iterator. You likely needed to write something like next({iter}()) or use it in a `for` loop to get a number from it before comparing it to {number}.
fi: `{iter}` on iteraattori. Sinun täytyi todennäköisesti kirjoittaa jotain kuten next({iter}()) tai käyttää sitä `for`-silmukassa saadaksesi siitä numeron ennen sen vertaamista {number}:iin.

source: Perhaps you meant to write `{operator}=` instead of `={operator}`
fi: Ehkä sinun piti kirjoittaa `{operator}=` eikä `={operator}`

source: You tried to use the unary operator '{operator}' with the following type of object: {obj}. This operation is not defined for this type of object.
fi: Yritit käyttää unaarista operaattoria '{operator}' seuraavan tyyppisen objektin kanssa: {obj}. Tätä operaatiota ei ole määritelty tälle objektityypille.

source: In Python, some objects are known as immutable: once defined, their value cannot be changed. You tried change part of such an immutable object: {obj}, most likely by using an indexing operation.
fi: Pythonissa joitakin objekteja kutsutaan muuttumattomiksi: kun ne on kerran määritelty, niiden arvoa ei voi muuttaa. Tällaisen muuttumattoman objektin osaa voi yrittää muuttaa: {obj}, todennäköisesti käyttämällä indeksointioperaatiota.

source: Did you mean to use a list?
fi: Tarkoititko käyttää luetteloa?

source: Perhaps you meant to use a list instead.
fi: Ehkä sinun piti käyttää luetteloa.

source: Exceptions must be derived from `BaseException`. It is recommended that user-defined exceptions derive from `Exception`, a subclass of `BaseException`.
fi: Virheiden on johdettava `BaseExceptionista`. On suositeltavaa, että käyttäjän määrittelemät virheet johdetaan `Exceptionista`, joka on `BaseExceptionin` aliluokka.

source: In an `except` statement, you must only have classes that derive from `BaseException`.
fi: `except`-lausekkeessa saa olla vain luokkia, jotka ovat johdannaisia `BaseExceptionista`.

source: The following is not a valid classes: `{not_exception}`.
fi: Seuraava ei ole kelvollinen luokka: `{not_exception}`.

source: The following are not valid classes: `{not_exception}`.
fi: Seuraavat luokat eivät ole kelvollisia: `{not_exception}`.

source: You apparently have called the function `{fn_name}` with {nb_given} positional argument(s) while it requires {nb_required} such positional argument(s).
fi: Olet ilmeisesti kutsunut funktiota `<{fn_name}` {nb_given}-asema-argumentilla (-argumenteilla), vaikka se vaatii {nb_required}-asema-argumentin (-argumentit).

source: Perhaps you forgot `self` when defining `{fn_name}`.
fi: Ehkä unohdit `self` määritellessäsi `{fn_name}`.

source: You apparently have called the function '{fn_name}' with fewer positional arguments than it requires ({nb_required} missing).
fi: Olet ilmeisesti kutsunut funktiota '{fn_name}' vähemmillä argumenteilla kuin se vaatii ({nb_required} puuttuu).

source: Note: `NoneType` means that the object has a value of `None`.
fi: Huomautus: `NoneType` tarkoittaa, että objektin arvo on `None`.

source: Python indicates that you have an object of type `{obj_type}`, followed by something surrounded by parentheses, `(...)`, which Python took as an indication of a function call. Either the object of type `{obj_type}` was meant to be a function, or you forgot a comma before `(...)`.
fi: Python ilmoittaa, että sinulla on objekti, jonka tyyppi on `{obj_type}`, jota seuraa sulkujen ympäröimä `(...)`, jonka Python otti osoitukseksi funktiokutsusta. Joko tyypin `{obj_type}` oli tarkoitus olla funktio, tai sitten unohdit pilkun ennen `(...)`.

source: The parenthesis `()` following `{obj_name}` are interpreted by Python as a function call for `{obj_name}`. However, `{obj_name}` is not a function but an object of type `{obj_type}`.
fi: Python tulkitsee `{obj_name}`:n perässä olevat sulkeet `()` funktiokutsuksi `{obj_name}`:lle. `{obj_name}` ei kuitenkaan ole funktio vaan objekti, jonka tyyppi on `{obj_type}`.

source: Because of the surrounding parenthesis, `{fn_call}` is interpreted by Python as indicating a function call for `{obj_name}`, which is an object of type `{obj_type}` which cannot be called.
fi: Ympäröivien sulkeiden vuoksi Python tulkitsee `{fn_call}`:n osoittavan funktiokutsua `{obj_name}`:lle, joka on tyyppiä `{obj_type}` oleva objekti, jota ei voi kutsua.

source: However, `{fn_call}` is a `tuple`. Either the object `{obj_name}` was meant to be a function or you have a missing comma between the object `{obj_name}` and the tuple `{fn_call}` and meant to write `{obj_name}, {fn_call}`.
fi: Kuitenkin `<{fn_call}` on `tuple`. Joko objektin `{obj_name}` oli tarkoitus olla funktio tai sitten objektin `{obj_name}` ja tuplen `<{fn_call}` väliltä puuttuu pilkku ja sinun piti kirjoittaa `{obj_name}, {fn_call}`.

source: Did you forget a comma between `{obj_name}` and `{fn_call}`?
fi: Unohditko pilkun `{obj_name}` ja `{fn_call}` väliin?

source: However, `{obj_name}` is a sequence. Perhaps you meant to use `[]` instead of `()` and write `{obj_name}[{slice}]`
fi: `{obj_name}` on kuitenkin sekvenssi. Ehkä sinun piti käyttää `[]` eikä `()` ja kirjoittaa `{obj_name}[{slice}]`.

source: Did you mean `{obj_name}[{slice}]`?
fi: Tarkoititko `{obj_name}[{slice}]`?

source: However, both `{obj_name}` and `{fn_call}` are numbers. Perhaps you forgot a multiplication operator, `*`, and meant to write `{obj_name} * {fn_call}`.
fi: Kuitenkin sekä `{obj_name}` että `{fn_call}` ovat numeroita. Ehkä unohdit kertolaskuoperaattorin `*` ja tarkoitit kirjoittaa `{obj_name} * {fn_call}`.

source: Did you mean `{obj_name} * {fn_call}`?
fi: Tarkoititko `{obj_name} * {fn_call}`?

source: Did you forget to convert `{name}` into an integer?
fi: Unohditko muuntaa `{name}` kokonaisluvuksi?

source: Perhaps you forgot to convert `{name}` into an integer.
fi: Ehkä unohdit muuntaa `{name}` kokonaisluvuksi.

source: You can only multiply sequences, such as list, tuples, strings, etc., by integers.
fi: Voit kertoa vain jaksoja, kuten listoja, tupleja, merkkijonoja jne., kokonaisluvuilla.

source: Did you forget to convert `{name1}` and `{name2}` into integers?
fi: Unohditko muuntaa `{name1}` ja `{name2}` kokonaisluvuiksi?

source: Perhaps you forgot to convert `{name1}` and `{name2}` into integers.
fi: Ehkä unohdit muuntaa `{name1}` ja `{name2}` kokonaisluvuiksi.

source: You wrote an object whose value is `None` where an integer was expected.
fi: Kirjoitit objektin, jonka arvo on `None`, kun odotettiin kokonaislukua.

source: You wrote an object of type `{obj}` where an integer was expected.
fi: Kirjoitit tyypin `{obj}` objektin, kun odotettiin kokonaislukua.

source: Did you forget to convert `{names}` into integers?
fi: Unohditko muuntaa `{names}` kokonaisluvuiksi?

source: Perhaps you forgot to convert `{names}` into integers.
fi: Ehkä unohdit muuntaa `{names}` kokonaisluvuiksi.

source: In the expression `{line}` what is included between the square brackets, `[...]`, must be either an integer or a slice (`start:stop` or `start:stop:step`) and you have used {obj_type} instead.
fi: Lausekkeessa `{line}` hakasulkujen välissä olevan `[...]` on oltava joko kokonaisluku tai viipale (`start:stop` tai `start:stop:step`), ja olet käyttänyt sen sijaan {obj_type}.

source: Note: sometimes this exception is raised because what Python interprets as indices was meant to be a separate list, and a comma should have been written before the opening `[` of that list.
fi: Huomautus: joskus tämä virhe aiheutuu, koska se, mitä Python tulkitsee indekseiksi, oli tarkoitettu erilliseksi listaksi, ja pilkku olisi pitänyt kirjoittaa ennen listan avaavaa `[`-merkkiä.

source: Did you forget a comma?
fi: Unohditko pilkun?

source: Perhaps you have forgotten a comma between two identical lists `{container}`. The second list had been interpreted as the indexation of the first one by the index `{new_index}`
fi: Ehkä olet unohtanut pilkun kahden samanlaisen listan `{container}` väliin. Toinen lista oli tulkittu ensimmäisen listan indeksoinniksi indeksillä `{new_index}`.

source: Perhaps you have forgotten a comma between the object `{container}` and the list `{index}`. The list `{index}` had been interpreted as the indexation of object `{container}` by the index `{new_index}`
fi: Ehkä olet unohtanut pilkun objektin `{container}` ja luettelon `{index}` väliin. Lista `{index}` oli tulkittu objektin `{container}` indeksoinniksi indeksillä `{new_index}`.

source: Did you forget a comma before `{index}`?
fi: Unohditko pilkun ennen `{index}`?

source: When using a slice to extract a range of elements from a sequence, that is something like `[start:stop]` or `[start:stop:step]` each of `start`, `stop`, `step` must be either an integer, `None`, or possibly some other object having an `__index__` method.
fi: Kun käytät viipaletta poimimaan elementtialuetta sarjasta, eli jotain sellaista kuin `[start:stop]` tai `[start:stop:step]`, jokaisen `start`, `stop` ja `step` täytyy olla joko kokonaisluku, `None` tai mahdollisesti jokin muu objekti, jolla on `__index__`-metodi.

source: Only hashable objects can be used as elements of `set` or keys of `dict`. Hashable objects are objects that do not change value once they have been created.
fi: Ainoastaan hashable-olioita voidaan käyttää `set`:n elementteinä tai `dict`:n avaimina. Hashable-oliot ovat olioita, joiden arvo ei muutu sen jälkeen, kun ne on luotu.

source: Instead of using {original}, consider using {replacement}.
fi: Harkitse {original}:n sijasta {replacement}:n käyttöä.

source: Subscriptable objects are typically containers from which you can retrieve item using the notation `[...]`.
fi: Subscriptable-objektit ovat tyypillisesti säiliöitä, joista voit hakea kohteen käyttämällä merkintää `[...]`.

source: Using this notation, you attempted to retrieve an item from an object of type `{obj_type}` which is not allowed.
fi: Tätä merkintätapaa käyttämällä yritit hakea kohteen tyypin `{obj_type}` objektista, mikä ei ole sallittua.

source: Perhaps you meant to write `{line}`.
fi: Ehkä sinun piti kirjoittaa `{line}`.

source: Using this notation, you attempted to retrieve an item from `{name}`, an object of type `{obj_type}`. This is not allowed.
fi: Tätä merkintätapaa käyttäen yritit hakea kohteen `{name}`, joka on tyyppiä `{obj_type}`. Tämä ei ole sallittua.

source: An iterable is an object capable of returning its members one at a time. Python containers (`list, tuple, dict`, etc.) are iterables. '{obj_name}' is not a container. A container is required here.
fi: Iteroituva objekti on objekti, joka pystyy palauttamaan jäsenensä yksi kerrallaan. Python-kontit (`list, tuple, dict` jne.) ovat iteroituvia objekteja. '{obj_name}' ei ole kontti. Tässä tarvitaan kontti.

source: An iterable is an object capable of returning its members one at a time. Python containers (`list, tuple, dict`, etc.) are iterables. An iterable is required here.
fi: Iteroituva objekti on objekti, joka pystyy palauttamaan jäsenensä yksi kerrallaan. Python-kontit (`list, tuple, dict` jne.) ovat iteroituvia objekteja. Tässä tarvitaan iteroituva objekti.

source: Unpacking is a convenient way to assign a name, to each item of an iterable.
fi: Pakkauksen purkaminen on kätevä tapa antaa nimi jokaiselle iterable-olion elementille.

source: An iterable is an object capable of returning its members one at a time. Python containers (`list, tuple, dict`, etc.) are iterables, but not objects of type `{obj_type}`.
fi: Iteroituva objekti on objekti, joka pystyy palauttamaan jäsenensä yksi kerrallaan. Python-kontit (`list, tuple, dict` jne.) ovat iteroituvia objekteja, mutta eivät objekteja, joiden tyyppi on `{obj_type}`.

source: {function} does not accept a sequence as an argument. Instead of writing `{line}` perhaps you should use the `dict.fromkeys()` method: `{new_line}`.
fi: {function} ei hyväksy sarjaa argumenttina. Sen sijaan, että kirjoittaisit `{line}`, ehkä sinun pitäisi käyttää `dict.fromkeys()`-metodia: `{new_line}`.

source: Perhaps you need to use the `dict.fromkeys()` method.
fi: Ehkä sinun on käytettävä `dict.fromkeys()`-menetelmää.

source: Did you forget to call `{name}`?
fi: Unohditko kutsua `{name}`?

source: I suspect that you forgot to add parentheses to call `{name}`. You might have meant to write: `{line}`
fi: Epäilen, että unohdit lisätä sulkeet kutsuun `{name}`. Olisit ehkä tarkoittanut kirjoittaa: `{line}`.

source: The function `vars` is used to list the content of the `__dict__` attribute of an object.
fi: Funktiota `vars` käytetään objektin `__dict__`-attribuutin sisällön listaamiseen.

source: Object `{name}` uses `__slots__` instead of `__dict__`.
fi: Objekti `{name}` käyttää `__slots__` eikä `__dict__`.

source: `{name}`, the argument of `vars`, is an object without such an attribute.
fi: `{name}`, argumentti `vars`, on objekti, jolla ei ole tällaista attribuuttia.

source: You have specified the value of argument `{argument}` more than once when calling the function named `{function}`.
fi: Olet antanut argumentin `{argument}` arvon useammin kuin kerran kutsuessasi funktiota nimeltä `{function}`.

source: This function has only one argument: `{arguments}`
fi: Tällä funktiolla on vain yksi argumentti: `{arguments}``

source: This function has the following arguments: `{arguments}`
fi: Tällä funktiolla on seuraavat argumentit: `{arguments}``

source: I am guessing that you were trying to count the number of elements produced by a generator expression. You first need to capture them in a list:
fi: Oletan, että yritit laskea generaattorilausekkeen tuottamien elementtien määrän. Sinun on ensin kerättävä ne luetteloon:

source: You likely need to build a list first.
fi: Sinun on todennäköisesti ensin luotava lista.

source: You are attempting to subclass a module. You likely forgot to import a class from that module.
fi: Yrität käyttää aliluokkaa moduulissa. Olet todennäköisesti unohtanut tuoda luokan kyseisestä moduulista.

source: Did you mean `{new_line}`?
fi: Tarkoititko `{new_line}`?

source: You are attempting to subclass the module `{mod_name}`. Perhaps you meant: {new_line} ...
fi: Yrität alaluokittaa moduulin `{mod_name}`. Ehkä tarkoitit: {new_line} ...

source: `{name}` is a `GenericAlias` used for type annotations.
fi: `{name}` on `GenericAlias`, jota käytetään tyyppimerkinnöissä.

source: You're trying to use the name `{name}` identified by Python as being in the local scope of a function before having assigned it a value.
fi: Yrität käyttää nimeä `{name}`, jonka Python on tunnistanut olevan funktion paikallisella alueella ennen kuin sille on annettu arvo.

source: The name `{var_name}` exists in both the global and nonlocal scope. This can be rather confusing and is not recommended. Depending on which variable you wanted to refer to, you needed to add either global {var_name} or nonlocal {var_name} as the first line inside your function.
fi: Nimi `{var_name}` on olemassa sekä globaalissa että ei-lokaalisessa laajuudessa. Tämä voi olla melko sekavaa, eikä sitä suositella. Riippuen siitä, kumpaan muuttujaan halusit viitata, sinun piti lisätä joko globaali {var_name} tai ei-lokaali {var_name} ensimmäiseksi riviksi funktiosi sisällä.

source: Did you forget to add either `global {var_name}` or `nonlocal {var_name}`?
fi: Unohditko lisätä joko `global {var_name}` tai `nonlocal {var_name}`?

source: `{name}` is a Python builtin function. You have tried to assign a value to `{name}` inside a function while also using its original meaning in the function. Note that it is generally not a good idea to give a local variable the same name as a Python builtin function (like `{name}`).
fi: `{name}` on Pythonin sisäänrakennettu funktio. Olet yrittänyt antaa arvon `{name}`:lle funktiossa ja samalla käyttää sen alkuperäistä merkitystä funktiossa. Huomaa, että yleensä ei ole hyvä idea antaa paikalliselle muuttujalle samaa nimeä kuin Pythonin sisäänrakennetulle funktiolle (kuten `{name}`).

source: The name `{var_name}` exists in the {scope} scope. Perhaps the statement {scope} {var_name} should have been included as the first line inside your function.
fi: Nimi `{var_name}` on olemassa {scope}-alueella. Ehkä lauseke {scope} {var_name} olisi pitänyt sisällyttää ensimmäiseksi riviksi funktiosi sisälle.

source: Did you forget to add `{scope} {var_name}`?
fi: Unohditko lisätä `{scope} {var_name}`?

source: The similar name `{name}` was found in the local scope.
fi: Samankaltainen nimi `{name}` löytyi paikallisesta alueesta.

source: In this instance, there are more names ({nb_names}) than {length}, the length of the iterable.
fi: Tässä tapauksessa nimiä ({nb_names}) on enemmän kuin {length}, iteratiivin pituus.

source: In this instance, there are more names ({nb_names}) than the length of the iterable, {iter_type} of length {length}.
fi: Tässä tapauksessa nimiä ({nb_names}) on enemmän kuin iteroitavan {iter_type}:n pituus {length}.

source: In this instance, there are fewer names ({nb_names}) than the length of the iterable.
fi: Tässä tapauksessa nimiä ({nb_names}) on vähemmän kuin iterable-taulukon pituus.

source: In this instance, there are fewer names ({nb_names}) than the length of the iterable, {iter_type} of length {length}.
fi: Tässä tapauksessa nimiä ({nb_names}) on vähemmän kuin iteroitavan {iter_type}:n pituus {length}.

source: `int()` expects an argument that looks like a number in base `{base}` but you gave it an empty string.
fi: `int()` odottaa argumenttia, joka näyttää luvulta peruskokoonpanossa `{base}`, mutta annoit sille tyhjän merkkijonon.

source: `{value}` is an invalid argument for `int()` in base `{base}`.
fi: `<{value}` on virheellinen argumentti `int()`:lle `{base}`-perustassa `{base}`.

source: The following characters are not allowed: `{invalid}`.
fi: Seuraavat merkit eivät ole sallittuja: `<{invalid}`.
