Repository: raikasdev/koodieditori
Catalog: src/workers/python/*/friendly_tb_*.po
Languages: fi

source: The file {filename} does not exist.
fi: Tiedostoa {filename} ei ole olemassa.

source: The available languages are:
fi: Käytettävissä olevat kielet ovat:

source: {include}: Unrecognized value.
fi: {include}: Tunnistamaton arvo.

source: The allowed values are:
fi: Sallitut arvot ovat:

source: Warning issued on line `{line}` of code block {filename}.
fi: Varoitus annettu koodilohkon {filename} rivillä `{line}`.

source: Warning issued on line `{line}` of file '{filename}'.
fi: Varoitus annettiin rivillä `{line}` tiedostossa '{filename}'.

source: The source is unavailable. If you used `exec`, consider using `friendly_exec` instead.
fi: Lähde ei ole käytettävissä. Jos käytit `exec`, harkitse sen sijaan `friendly_exec`:n käyttöä.

source: I have no suggestion to offer.
fi: Minulla ei ole mitään ehdotuksia.

source: I have no suggestion to offer; try `why()`.
fi: Minulla ei ole ehdottaa mitään; kokeile `why()`.

source: Are you using a regular Python console instead of a Friendly console? If so, to continue, try: `start_console(local_vars=locals())`. You will need to import `start_console` if you have not already done so.
fi: Käytätkö tavallista Python-konsolia etkä Friendly-konsolia? Jos näin on, jatka yrittämällä: Sinun on tuotava `start_console`, jos et ole vielä tehnyt sitä.

source: Nothing to show: no exception recorded.
fi: Ei mitään näytettävää: virhettä ei ole kirjattu.

source: Invalid index value.
fi: Virheellinen indeksiarvo.

source: An exception occurred before friendly-traceback was imported. Some information is available.
fi: Virhe tapahtui ennen kuin friendly-traceback tuotiin. Joitakin tietoja on saatavilla.

source: Friendly-traceback is already disabled.
fi: Friendly-traceback on jo poistettu käytöstä.

source: Friendly-traceback is already enabled.
fi: Friendly-traceback on jo käytössä.

source: Shows a list of recorded traceback messages.
fi: Näyttää luettelon tallennetuista jäljityssanomista.

source: You can also use `history.clear()` and `history.pop()`.
fi: Voit myös käyttää `history.clear()` ja `history.pop()`.

source: Nothing to delete: no exception recorded.
fi: Ei mitään poistettavaa: virhettä ei ole kirjattu.

source: There is no such history item.
fi: Tällaista historiatietoa ei ole olemassa.

source: {exception} is not an exception.
fi: {exception} ei ole virhe.

source: The default web browser cannot be used for searching.
fi: Oletusarvoista verkkoselainta ei voi käyttää hakuun.

source: Invalid argument for `www()`. Valid arguments are integer values or one of `{sites}`.
fi: Virheellinen argumentti komennolle `www()`. Kelvollisia argumentteja ovat kokonaislukuarvot tai yksi seuraavista: `{sites}`.

source: The following methods of the Friendly object should also be available as functions.
fi: Friendly-objektin seuraavien metodien pitäisi olla käytettävissä myös funktioina.

source: More lines not shown.
fi: Muita rivejä ei ole esitetty.

source: Python exception:
fi: Python-virhe:

source: The exception includes the following note:
fi: Virheeseen sisältyy seuraava huomautus:

source: The exception includes the following notes:
fi: Virhe sisältää seuraavat huomautukset:

source: Warning: improperly formed exception. I suspect that a custom exception has been raised with a non-string value used as a message. This can occur if a `__repr__` or a `__str__` method raises an exception or does not return a string.
fi: Varoitus: väärin muodostettu virhe. Epäilen, että kyseessä on muokautettu virhe, jonka viestinä on käytetty muuta kuin merkkijonoarvoa. Tämä voi tapahtua, jos `__repr__`- tai `__str__`-metodi antaa virheen tai ei palauta merkkijonoa.

source: The encoding of the file was not valid.
fi: Tiedoston koodaus ei ollut kelvollinen.

source: {filename} is not a regular Python file whose contents can be analyzed.
fi: {filename} ei ole tavallinen Python-tiedosto, jonka sisältöä voidaan analysoida.

source: If you used `exec`, consider using `friendly_exec` instead.
fi: Jos olet käyttänyt `exec`, harkitse sen sijaan `friendly_exec` käyttöä.

source: Exception raised on line `{linenumber}` of code block {filename}.
fi: Koodilohkon {filename} rivillä `<{linenumber}` havaittu virhe.

source: Exception raised on line `{linenumber}` of file '{filename}'.
fi: Virhe havaittiin rivillä `<{linenumber}` tiedostossa '{filename}'.

source: Execution stopped on line `{linenumber}` of code block {filename}.
fi: Suoritus pysähtyi koodilohkon {filename} riville `<{linenumber}`.

source: Execution stopped on line `{linenumber}` of file '{filename}'.
fi: Suoritus pysähtyi riville `{linenumber}` tiedostossa '{filename}'.

source: Code block {filename}, line `{line}`
fi: Koodilohko {filename}, rivi `<{line}``

source: File '{filename}', line `{line}`
fi: Tiedosto '{filename}', rivi `<{line}``

source: The entire content of `{filename}` is not available.
fi: `{filename}`:n koko sisältö ei ole käytettävissä.

source: Python could not understand the code in the code block {filename}
fi: Python ei ymmärtänyt koodilohkossa olevaa koodia {filename}.

source: Python could not understand the code in the file '{filename}'
fi: Python ei ymmärtänyt tiedostossa '{filename}' olevaa koodia.

source: at the location indicated.
fi: ilmoitetussa paikassa.

source: Unfortunately, no additional information is available: the content of file '<stdin>' is not accessible.
fi: Valitettavasti lisätietoja ei ole saatavilla: tiedoston '<stdin>' sisältöön ei pääse käsiksi.

source: Fatal error - aborting
fi: Kohtalokas virhe - keskeytys

source: Please report this issue.
fi: Ilmoita tästä asiasta.

source: Problem: source of `{filename}` is not available
fi: Ongelma: `{filename}` lähdettä ei ole saatavilla.

source: Use exit() or Ctrl-Z plus Return to exit.
fi: Käytä exit() tai Ctrl-Z plus Return poistuaksesi.

source: Use exit() or Ctrl-D to exit.
fi: Käytä exit() tai Ctrl-D poistuaksesi.

source: Type 'Friendly' for help on special functions/methods.
fi: Kirjoita 'Friendly' saadaksesi apua erikoistoiminnoista/menetelmistä.

source: Please report this example to https://github.com/friendly-traceback/friendly-traceback/issues/new If you are using a REPL, use `www('bug')` to do so.
fi: Ilmoita tästä esimerkistä osoitteeseen https://github.com/friendly-traceback/friendly-traceback/issues/new Jos käytät REPL:ää, käytä `www('bug')`.

source: Friendly-traceback does not know the cause of this error.
fi: Friendly-traceback ei tiedä tämän virheen syytä.

source: No information is known about this exception.
fi: Tästä virheestä ei ole tietoa.

source: If you are using the Friendly console, use `www()` to do an Internet search for this particular case.
fi: Jos käytät Friendly-konsolia, käytä `www()` tehdessäsi Internet-hakua tästä tapauksesta.

source: Internal error for Friendly.
fi: Sisäinen virhe ystävälle.

source: Disable friendly-traceback and restore previous exception hook.
fi: Poista friendly-traceback käytöstä ja palauta edellinen virhekoukku.

source: Enable friendly-traceback as an exception hook
fi: Ota friendly-traceback käyttöön virhekoukkuna

source: Shows all the information about the last traceback.
fi: Näyttää kaikki tiedot viimeisimmästä jäljityksestä.

source: Sets the language to be used.
fi: Asettaa käytettävän kielen.

source: Shows the paths corresponding to synonyms used.
fi: Näyttää käytettyjä synonyymejä vastaavat polut.

source: Shows the generic meaning of a given exception.
fi: Näyttää tietyn virheen yleisen merkityksen.

source: Shows where an exception was raised.
fi: Näyttää, missä virhe on aiheutunut.

source: Shows the likely cause of the exception.
fi: Näyttää virheen todennäköisen syyn.

source: Opens a web browser at a useful location.
fi: Avaa verkkoselaimen hyödylliseen paikkaan.

source: Suggestion sometimes added to a friendly traceback.
fi: Ehdotus on joskus lisätty ystävälliseen jäljitykseen.

source: Shows a normal Python traceback.
fi: Näyttää normaalin Python-selvityksen.

source: Shows a simplified Python traceback.
fi: Näyttää yksinkertaistetun Python-takaisinkytkennän.

source: Returns the current value used for items to include by default.
fi: Palauttaa nykyisen arvon, jota käytetään oletusarvoisesti sisällytettäviin kohteisiin.

source: Sets the items to show by default when an exception is raised.
fi: Määrittää kohteet, jotka näytetään oletusarvoisesti, kun virhe ilmenee.

source: Returns the language currently used.
fi: Palauttaa tällä hetkellä käytetyn kielen.

source: Sets the formatter to use for display.
fi: Asettaa näytössä käytettävän muotoilijan.

source: Use True (default) or False to enable debugging methods.
fi: Käytä True (oletusarvo) tai False ottaaksesi käyttöön virheenkorjausmenetelmät.

source: A warning of type `{name}` is a subclass of `{parent}`.
fi: Varoitus, jonka tyyppi on `{name}`, on `{parent}`:n aliluokka.

source: An exception of type `{name}` is a subclass of `{parent}`.
fi: Virhe, jonka tyyppi on `{name}`, on `{parent}`:n alaluokka.

source: Nothing more specific is known about `{name}`.
fi: `{name}`:sta ei tiedetä mitään tarkempaa.

source: The inheritance is as follows: {tree}
fi: Perinnöllisyys on seuraava: {tree}

source: Most built-in exceptions defined by Python are derived from `Exception`. All user-defined exceptions should also be derived from this class.
fi: Useimmat Pythonin määrittelemät sisäänrakennetut virheet on johdettu luokasta `Exception`. Kaikki käyttäjän määrittelemät virheet tulisi myös johtaa tästä luokasta.

source: `BaseException` is the base class for all built-in exceptions. It is not meant to be directly inherited by user-defined classes.
fi: `BaseException` on perusluokka kaikille sisäänrakennetuille virheille, eikä sitä ole tarkoitus periyttää suoraan käyttäjän määrittelemiin luokkiin.

source: `ArithmeticError` is the base class for those built-in exceptions that are raised for various arithmetic errors.
fi: `ArithmeticError` on perusluokka niille sisäänrakennetuille virheille, jotka herätetään erilaisista aritmeettisista virheistä.

source: In Python, the keyword `assert` is used in statements of the form `assert condition`, to confirm that `condition` is not `False`, nor equivalent to `False` such as an empty list, etc. If `condition` is `False` or equivalent, an `AssertionError` is raised.
fi: Pythonissa avainsanaa `assert` käytetään lausekkeissa, jotka ovat muotoa `assert condition`, varmistaakseen, että `condition` ei ole `False` tai vastaava kuin `False`, kuten tyhjä lista jne. Jos `condition` on `False` tai vastaava, annetaan `AssertionError`.

source: An `AttributeError` occurs when the code contains something like `object.x` and `x` is not a method or attribute (variable) belonging to `object`.
fi: `AttributeError` tapahtuu, kun koodi sisältää jotain kuten `object.x` ja `x` ei ole metodi tai attribuutti (muuttuja), joka kuuluu `object`:iin.

source: An `EOFError` is raised when the `input()` function hits an end-of-file condition (EOF) without reading any data.
fi: `EOFError`-virhe annetaan, kun `input()`-funktio osuu tiedoston loppuehtoon (EOF) lukematta mitään dataa.

source: A `FileNotFoundError` exception indicates that you are trying to open a file that cannot be found by Python. This could be because you misspelled the name of the file.
fi: Virhe `FileNotFoundError` tarkoittaa, että yrität avata tiedostoa, jota Python ei löydä. Tämä voi johtua siitä, että tiedoston nimi on kirjoitettu väärin.

source: An `ImportError` exception indicates that a certain object could not be imported from a module or package. Most often, this is because the name of the object is not spelled correctly.
fi: `ImportError`-virhe osoittaa, että tiettyä objektia ei voitu tuoda moduulista tai paketista. Useimmiten tämä johtuu siitä, että objektin nimi on kirjoitettu väärin.

source: An `IndentationError` occurs when a given line of code is not indented (aligned vertically with other lines) as expected.
fi: `IndentationError`-virhe tapahtuu, kun tiettyä koodiriviä ei ole sisennetty (kohdistettu pystysuoraan muiden rivien kanssa) odotetulla tavalla.

source: An `IndexError` occurs when you try to get an item from a list, a tuple, or a similar object (sequence), and use an index which does not exist; typically, this happens because the index you give is greater than the length of the sequence.
fi: `IndexError` tapahtuu, kun yrität hakea elementtiä listasta, tuplesta tai vastaavasta objektista (sequence) ja käytät indeksiä, jota ei ole olemassa; yleensä tämä tapahtuu, koska antamaasi indeksiä on enemmän kuin sequence:n pituus.

source: A `KeyError` is raised when a value is not found as a key in a Python dict or in a similar object.
fi: `KeyError`-ilmoitus annetaan, kun arvoa ei löydy avaimena Python dictistä tai vastaavasta objektista.

source: `LookupError` is the base class for the exceptions that are raised when a key or index used on a mapping or sequence is invalid. It can also be raised directly by codecs.lookup().
fi: `LookupError` on perusluokka virheille, jotka herätetään, kun kartoituksessa tai sekvenssissä käytetty avain tai indeksi on virheellinen. Se voidaan herättää myös suoraan codecs.lookup():lla.

source: Like the name indicates, a `MemoryError` occurs when Python runs out of memory. This can happen if you create an object that is too big, like a list with too many items.
fi: Kuten nimestä käy ilmi, `MemoryError` ilmenee, kun Pythonilta loppuu muisti. Näin voi tapahtua, jos luot liian suuren objektin, kuten listan, jossa on liian monta kohdetta.

source: A `ModuleNotFoundError` exception indicates that you are trying to import a module that cannot be found by Python. This could be because you misspelled the name of the module or because it is not installed on your computer.
fi: Virhe `ModuleNotFoundError` tarkoittaa, että yrität tuoda moduulia, jota Python ei löydä. Tämä voi johtua siitä, että olet kirjoittanut moduulin nimen väärin tai että sitä ei ole asennettu tietokoneellesi.

source: A `NameError` exception indicates that a variable or function name is not known to Python. Most often, this is because there is a spelling mistake. However, sometimes it is because the name is used before being defined or given a value.
fi: `NameError`-virhe osoittaa, että muuttujan tai funktion nimeä ei tunneta Pythonissa. Useimmiten tämä johtuu kirjoitusvirheestä. Joskus se johtuu kuitenkin siitä, että nimeä käytetään ennen kuin se on määritelty tai sille on annettu arvo.

source: An `OSError` exception is usually raised by the Operating System to indicate that an operation is not allowed or that a resource is not available.
fi: Käyttöjärjestelmä herättää yleensä `OSError`-virhe osoittaakseen, että jokin toiminto ei ole sallittu tai että resurssi ei ole käytettävissä.

source: An `OverflowError` is raised when the result of an arithmetic operation is too large to be handled by the computer's processor.
fi: `OverflowError`-virhe annetaan, kun aritmeettisen operaation tulos on liian suuri tietokoneen prosessorin käsiteltäväksi.

source: A `RecursionError` is raised when a function calls itself, directly or indirectly, too many times. It almost always indicates that you made an error in your code and that your program would never stop.
fi: `RecursionError` tulee esiin, kun funktio kutsuu itseään, suoraan tai epäsuorasti, liian monta kertaa. Se osoittaa lähes aina, että olet tehnyt virheen koodissasi ja että ohjelmasi ei koskaan pysähtyisi.

source: A `RuntimeError` is raised when an error is detected that doesn't fall in any of the more specific exception types defined by Python.
fi: `RuntimeError` herätetään, kun havaitaan virhe, joka ei kuulu mihinkään Pythonin määrittelemiin virhetyyppeihin.

source: `StopIteration` is raised to indicate that an iterator has no more item to provide when its `__next__` method is called by the `next()` builtin function.
fi: `StopIteration` nostetaan ilmaisemaan, että iteraattorilla ei ole enempää kohteita tarjottavana, kun sen `__next__`-metodia kutsutaan `next()`-rakennetulla funktiolla.

source: A `SyntaxError` occurs when Python cannot understand your code.
fi: `SyntaxError` aiheutuu, kun Python ei ymmärrä koodiasi.

source: A `TabError` indicates that you have used both spaces and tab characters to indent your code. This is not allowed in Python. Indenting your code means to have block of codes aligned vertically by inserting either spaces or tab characters at the beginning of lines. Python's recommendation is to always use spaces to indent your code.
fi: `TabError` tarkoittaa, että olet käyttänyt sekä välilyöntejä että tabulaattorimerkkejä koodin sisennykseen. Tämä ei ole sallittua Pythonissa. Koodin sisennys tarkoittaa koodilohkojen kohdistamista pystysuoraan joko välilyöntejä tai tabulaattorimerkkejä rivien alkuun. Python suosittelee, että koodin sisennykseen käytetään aina välilyöntejä.

source: A `TypeError` is usually caused by trying to combine two incompatible types of objects, by calling a function with the wrong type of object, or by trying to do an operation not allowed on a given type of object.
fi: `TypeError` aiheutuu yleensä siitä, että yritetään yhdistää kaksi yhteensopimatonta objektityyppiä, kutsutaan funktiota väärän tyyppisellä objektilla tai yritetään tehdä operaatio, joka ei ole sallittu tietyn tyyppiselle objektille.

source: A `ValueError` indicates that a function or an operation received an argument of the right type, but an inappropriate value.
fi: `ValueError` tarkoittaa, että funktio tai operaatio on saanut oikeantyyppisen argumentin, mutta vääränlaisen arvon.

source: In Python, variables that are used inside a function are known as local variables. Before they are used, they must be assigned a value. A variable that is used before it is assigned a value is assumed to be defined outside that function; it is known as a `global` (or sometimes `nonlocal`) variable. You cannot assign a value to such a global variable inside a function without first indicating to Python that this is a global variable, otherwise you will see an `UnboundLocalError`.
fi: Pythonissa funktion sisällä käytettäviä muuttujia kutsutaan paikallisiksi muuttujiksi. Ennen kuin niitä käytetään, niille on annettava arvo. Muuttuja, jota käytetään ennen kuin sille annetaan arvo, oletetaan määritellyksi funktion ulkopuolella; sitä kutsutaan `globaaliksi` (tai joskus `ei-lokaaliseksi`) muuttujaksi. Tällaiselle globaalille muuttujalle ei voi antaa arvoa funktion sisällä ilman, että Pythonille ilmoitetaan ensin, että kyseessä on globaali muuttuja, muuten saat `UnboundLocalError`-virheen.

source: A `ZeroDivisionError` occurs when you are attempting to divide a value by zero either directly or by using some other mathematical operation.
fi: `ZeroDivisionError`-virhe tapahtuu, kun yrität jakaa arvon nollalla joko suoraan tai käyttämällä jotain muuta matemaattista operaatiota.

source: `UserWarning` is the default class for `warnings.warn()`.
fi: `UserWarning` on `warnings.warn()`-luokan oletusluokka.

source: `SyntaxWarning` often indicates that your code will likely not give the result you expect.
fi: `SyntaxWarning` kertoo usein, että koodisi ei todennäköisesti anna odotettua tulosta.

source: `DeprecationWarning` indicates that some feature will not be available in a future version.
fi: `DeprecationWarning` tarkoittaa, että jokin ominaisuus ei ole käytettävissä tulevassa versiossa.

source: `RuntimeWarning` often indicates some not recommended runtime features.
fi: `RuntimeWarning` kertoo usein joistakin ei-suositelluista suoritusaikaominaisuuksista.

source: `FutureWarning` is the base category for features that will likely be deprecated in future Python versions.
fi: `FutureWarning` on peruskategoria ominaisuuksille, jotka todennäköisesti poistuvat käytöstä tulevissa Python-versioissa.

source: `UnicodeWarning` is the base category for warnings related to unicode.
fi: `UnicodeWarning` on unicodeen liittyvien varoitusten perusluokka.

source: `BytesWarning` is the base category for warnings related to bytes and bytearray.
fi: `BytesWarning` on peruskategoria tavuihin ja tavujoukkoihin liittyville varoituksille.

source: `Warning` is the base class of all warning category classes.
fi: `Warning` on kaikkien varoitusluokkien perusluokka.

source: a complex number
fi: kompleksiluku

source: a dictionary (`dict`)
fi: sanakirja (`dict`)

source: a number (`float`)
fi: luku (`float`)

source: a `frozenset`
fi: `frozenset`

source: an integer (`int`)
fi: kokonaisluku (`int`)

source: a variable equal to `None` (`NoneType`)
fi: muuttuja, jonka arvo on `None` (`NoneType`).

source: a string (`str`)
fi: merkkijono (`str`)

source: a `tuple`
fi: `tuple`

source: Friendly warning: you have redefined the python builtin `{name}`.
fi: Ystävällinen varoitus: olet määritellyt uudelleen pythonin sisäänrakennetun `{name}`.

source: Object too large to be processed by Python.
fi: Kohde on liian suuri Pythonin käsiteltäväksi.

source: Unable to compute.
fi: Laskenta ei onnistu.

source: A type hint found for `{name}` in the {scope} scope. Perhaps you had used a colon instead of an equal sign and wrote {name} : {hint} instead of {name} = {hint}
fi: {scope}-alueelta löytyi tyyppivihje `{name}`. Ehkä olit käyttänyt kaksoispistettä yhtäläisyysmerkin sijasta ja kirjoittanut {name} : {hint} {name} = {hint}:n sijasta.

source: The default directory is {dirname}.
fi: Oletushakemisto on {dirname}.

source: Did you give your program the same name as a Python module?
fi: Annoitko ohjelmallesi saman nimen kuin Python-moduulille?

source: I suspect that you used the name `{module}.py` for your program and that you also wanted to import a module with the same name from Python's standard library. If so, you should use a different name for your program.
fi: Epäilen, että käytit ohjelmassasi nimeä `{module}.py` ja että halusit myös tuoda samannimisen moduulin Pythonin standardikirjastosta. Jos näin on, sinun pitäisi käyttää ohjelmassasi eri nimeä.

source: You have a circular import.
fi: Teillä on ympäripyöreä tuonti.

source: You likely have a circular import.
fi: Sinulla on todennäköisesti ympyrätuonti.

source: Python indicated that the module `{module}` was not fully imported.
fi: Python ilmoitti, että moduulia `{module}` ei ollut tuotu kokonaan.

source: This can occur if, during the execution of the code in module `{module}` an attempt is made to import the same module again.
fi: Tämä voi tapahtua, jos moduulin `{module}` koodin suorituksen aikana yritetään tuoda sama moduuli uudelleen.

source: This should not happen: Python tells us that module `{module}` does not have an attribute named `{attribute}`. However, it does not appear that module `{module}` was imported.
fi: Näin ei pitäisi tapahtua: Python kertoo meille, että moduulissa `{module}` ei ole attribuuttia nimeltä `{attribute}`. Moduulia `{module}` ei kuitenkaan ole tuotu.

source: Did you mean `{name}`?
fi: Tarkoititko `{name}`?

source: Perhaps you meant to write `{module}.{correct}` instead of `{module}.{typo}`
fi: Ehkä sinun piti kirjoittaa `{module}.{correct}` eikä `{module}.{typo}`.

source: Instead of writing `{module}.{typo}`, perhaps you meant to write one of the following names which are attributes of module `{module}`: `{names}`
fi: Sen sijaan, että kirjoittaisit `<{module}.{typo}`, ehkä sinun piti kirjoittaa jokin seuraavista nimistä, jotka ovat moduulin `{module}` attribuutteja: `<{names}``

source: You imported a module named `{module}` from `{mod_path}`. There is also a module named `{module}` in Python's standard library. Perhaps you need to rename your module.
fi: Olet tuonut moduulin nimeltä `{module}` osoitteesta `{mod_path}`. Pythonin standardikirjastossa on myös moduuli nimeltä `{module}`. Ehkä sinun täytyy nimetä moduuli uudelleen.
