Repository: raikasdev/koodieditori
Catalog: src/workers/python/*/friendly_tb_*.po
Languages: fi

source: Perhaps you meant to use the attribute `{attribute}` of module `{mod_name}` instead of module `{module}`.
fi: Ehkä tarkoitit käyttää moduulin `{mod_name}` attribuuttia `{attribute}` moduulin `{module}` sijaan.

source: Did you mean one of the following modules: `{names}`?
fi: Tarkoititko jotakin seuraavista moduuleista: `{names}`?

source: Instead of the module `{module}`, perhaps you wanted to use the attribute `{attribute}` of one of the following modules: `{names}`.
fi: Moduulin `{module}` sijasta haluaisit ehkä käyttää jonkin seuraavan moduulin attribuuttia `{attribute}`: `{names}`.

source: Python tells us that no object with name `{attribute}` is found in module `{module}`.
fi: Python kertoo, että moduulista `{module}` ei löydy objektia, jonka nimi on `{attribute}`.

source: `add_note()` is only allowed for Python version 3.11 and newer.
fi: `add_note()` on sallittu vain Python-versiossa 3.11 ja uudemmissa.

source: You are using Python version {version}.
fi: Käytät Python-versiota {version}.

source: You are attempting to access the attribute `{attr}` for a variable whose value is `None`.
fi: Yrität käyttää attribuuttia `{attr}` muuttujalle, jonka arvo on `None`.

source: The value of attribute `{attribute}` of objects of type `{obj_type}` cannot be changed. I have no further information.
fi: Tyypin `{obj_type}` objektien `{obj_type}` attribuutin `{attribute}` arvoa ei voi muuttaa. Minulla ei ole lisätietoja.

source: Object `{name}` uses an empty `__slots__` to prevent the modification of any of its attributes.
fi: Objekti `{name}` käyttää tyhjää `__slots__` estääkseen minkään sen attribuutin muuttamisen.

source: Object `{name}` uses `__slots__` to specify which attributes can be changed. The value of attribute `{name}.{attribute}` cannot be changed.
fi: Objektissa `{name}` käytetään `__slots__` määrittämään, mitä attribuutteja voidaan muuttaa. Attribuutin `{name}.{attribute}` arvoa ei voi muuttaa.

source: `{obj_name}` is a function. Perhaps you meant to write `{obj_name}({attribute})`
fi: `{obj_name}` on funktio. Ehkä sinun piti kirjoittaa `{obj_name}({attribute})`.

source: Did you mean `{obj_name}({attribute})`?
fi: Tarkoititko `{obj_name}({attribute})`?

source: `{obj_name}` is a Python built-in function or method which does not have an attribute named `{attribute}.`
fi: `{obj_name}` on Pythonin sisäänrakennettu funktio tai menetelmä, jolla ei ole attribuuttia nimeltä `{attribute}.`

source: An object of type `{obj_type}` has no attribute named `{attr}`. Unfortunately I cannot find such an object on the line where the problem occurs.
fi: Tyypin `{obj_type}` objektilla ei ole attribuuttia nimeltä `{attr}`. Valitettavasti en löydä tällaista objektia riviltä, jossa ongelma ilmenee.

source: An object of type `{obj_type}` has no attribute named `{attr}`. I cannot give additional information: I found one object of this type in the current scope but it does not appear to be the object causing the problem.
fi: Tyypin `{obj_type}` objektilla ei ole attribuuttia nimeltä `{attr}`. En voi antaa lisätietoja: löysin yhden tämäntyyppisen objektin nykyiseltä alueelta, mutta se ei näytä olevan ongelman aiheuttava objekti.

source: An object of type `{obj_type}` has no attribute named `{attr}`. The following objects might be the cause of the problem: {names}.
fi: Tyypin `{obj_type}` objektilla ei ole attribuuttia nimeltä `{attr}`. Seuraavat objektit saattavat olla ongelman syynä: {names}.

source: The object `{obj}` has no attribute named `{attr}`.
fi: Objektilla `{obj}` ei ole attribuuttia nimeltä `{attr}`.

source: Note that object `{obj}` uses `__slots__` which prevents the creation of new attributes.
fi: Huomaa, että objekti `{obj}` käyttää `__slots__`, joka estää uusien attribuuttien luomisen.

source: The following are some of its known attributes: `{names}`.
fi: Seuraavassa on joitakin sen tunnetuista ominaisuuksista: `{names}`.

source: The object `{obj_name}` has no attribute named `{attribute}`.
fi: Objektilla `{obj_name}` ei ole attribuuttia nimeltä `{attribute}`.

source: Perhaps you meant to write `{obj}.{correct}` instead of `{obj}.{typo}`
fi: Ehkä sinun piti kirjoittaa `{obj}.{correct}` eikä `{obj}.{typo}`.

source: Did you mean one of the following: `{names}`?
fi: Tarkoititko jotakin seuraavista: `{names}`?

source: Instead of writing `{obj}.{typo}`, perhaps you meant to write one of the following names which are attributes of object `{obj}`: `{names}`
fi: Sen sijaan, että kirjoittaisit `{obj}.{typo}`, ehkä sinun piti kirjoittaa jokin seuraavista nimistä, jotka ovat objektin `{obj}` attribuutteja: `<{names}``.

source: Did you write a comma by mistake?
fi: Kirjoititko vahingossa pilkun?

source: `{obj_name}` is a tuple that contains a single item which does have `'{attribute}'` as an attribute. Perhaps you added a trailing comma by mistake at the end of the line where you defined `{obj_name}`.
fi: `{obj_name}` on tuple, joka sisältää yhden kohteen, jonka attribuutti on `'{attribute}'`. Ehkä lisäsit vahingossa pilkun sen rivin loppuun, jossa määrittelit `{obj_name}`.

source: Did you mean `{str_content}.join({obj_name})`?
fi: Tarkoititko `{str_content}.join({obj_name})`?

source: The object `{obj_name}` has no attribute named `join`. Perhaps you wanted something like `{str_content}.join({obj_name})`.
fi: Objektilla `{obj_name}` ei ole attribuuttia nimeltä `join`. Ehkä halusit jotain sellaista kuin `{str_content}.join({obj_name})`.

source: Did you mean `{known_builtin}({obj_name})`?
fi: Tarkoititko `{known_builtin}({obj_name})`?

source: The object `{obj_name}` has no attribute named `{attribute}`. Perhaps you can use the Python builtin function `{known_builtin}` instead: `{known_builtin}({obj_name})`.
fi: Objektilla `{obj_name}` ei ole attribuuttia nimeltä `{attribute}`. Ehkä voit käyttää sen sijaan Pythonin sisäänrakennettua funktiota `{known_builtin}`: `<{known_builtin}({obj_name})`.

source: Did you mean `{attr}`?
fi: Tarkoititko `{attr}`?

source: The object `{name}` has no attribute named `{attribute}`.
fi: Objektilla `{name}` ei ole attribuuttia nimeltä `{attribute}`.

source: However, `{attr}` is an attribute of `{name}` with a similar meaning.
fi: `{attr}` on kuitenkin `{name}`:n attribuutti, jolla on samanlainen merkitys.

source: However, `{name}` has the following attributes with similar meanings: `{attributes}`.
fi: `{name}`:llä on kuitenkin seuraavat attribuutit, joilla on samanlainen merkitys: `{attributes}`.

source: Did you mean to separate object names by a comma?
fi: Tarkoititko erottaa kohteiden nimet pilkulla?

source: `{second}` is not an attribute of `{first}`. However, both `{first}` and `{second}` are known objects. Perhaps you wrote a period to separate these two objects, instead of using a comma.
fi: `{second}` ei ole attribuutti kohteelle `{first}`. Kuitenkin sekä `{first}` että `{second}` ovat tunnettuja kohteita. Ehkä kirjoitit pisteen erottamaan nämä kaksi kohdetta toisistaan pilkun sijasta.

source: In your program, the name of the file that cannot be found is `{filename}`.
fi: Ohjelmassasi sen tiedoston nimi, jota ei löydy, on `{filename}`.

source: {directory} is not a valid directory.
fi: {directory} ei ole kelvollinen hakemisto.

source: It was expected to be found in the `{directory}` directory.
fi: Sen odotettiin löytyvän hakemistosta `{directory}`.

source: Did you mean `{similar}`?
fi: Tarkoititko `{similar}`?

source: The file `{similar}` has a similar name.
fi: Tiedostolla `{similar}` on samanlainen nimi.

source: Perhaps you meant one of the following files with similar names:
fi: Ehkä tarkoitit jotakin seuraavista samannimisistä tiedostoista:

source: I have no additional information for you.
fi: Minulla ei ole lisätietoja sinulle.

source: The object that could not be imported is `{name}`. The module or package where it was expected to be found is `{module}`.
fi: Objekti, jota ei voitu tuoda, on `{name}`. Moduuli tai paketti, josta sen odotettiin löytyvän, on `{module}`.

source: Python indicated that you have a circular import. This can occur if executing the code in module 'A' results in executing the code in module 'B' where an attempt to import a name from module 'A' is made before the execution of the code in module 'A' had been completed.
fi: Python ilmoitti, että sinulla on ympyrätuonti. Tämä voi tapahtua, jos koodin suorittaminen moduulissa 'A' johtaa koodin suorittamiseen moduulissa 'B', jossa yritetään tuoda nimi moduulista 'A' ennen kuin koodin suorittaminen moduulissa 'A' on saatu päätökseen.

source: Inconsistent state: `'{module}'` was apparently not imported. As a result, no further analysis can be done.
fi: Epäjohdonmukainen tila: `'{module}'`` ei ilmeisesti ole tuotu. Tämän seurauksena lisäanalyysiä ei voida tehdä.

source: Perhaps you meant to import `{correct}` (from `{module}`) instead of `{typo}`
fi: Ehkä tarkoitit tuoda `{correct}` (moduulista `{module}`) etkä `{typo}`.

source: Instead of trying to import `{typo}` from `{module}`, perhaps you meant to import one of the following names which are found in module `{module}`: `{candidates}`
fi: Sen sijaan, että olisit yrittänyt tuoda `{typo}` moduulista `{module}`, ehkä sinun piti tuoda jokin seuraavista nimistä, jotka löytyvät moduulista `{module}`: `{candidates}`.

source: The object that could not be imported is `{name}`.
fi: Kohde, jota ei voitu tuoda, on `{name}`.

source: The problem was likely caused by what is known as a 'circular import'. First, Python imported and started executing the code in file '{file}'. which imports module `{last_module}`. During this process, the code in another file, '{last_file}' was executed. However in this last file, an attempt was made to import the original module `{last_module}` a second time, before Python had completed the first import.
fi: Ongelma johtui todennäköisesti niin sanotusta 'ympyrätuonnista'. Python toi ensin tiedoston '{file}' koodin, joka tuo moduulin `{last_module}`, ja aloitti sen suorittamisen. Tämän prosessin aikana toisessa tiedostossa '{last_file}' olevaa koodia suoritettiin. Tässä viimeisessä tiedostossa yritettiin kuitenkin tuoda alkuperäinen moduuli `{last_module}` toisen kerran, ennen kuin Python oli suorittanut ensimmäisen tuonnin loppuun.

source: You have tried to assign a value to an item of an object of type `{obj_type}` which I cannot identify. The index you gave was not an allowed value.
fi: Olet yrittänyt antaa arvoa objektityypin `{obj_type}` kohteelle, jota en pysty tunnistamaan. Antamasi indeksi ei ole sallittu arvo.

source: You have tried to assign a value to index `{index}` of `{name}`, {obj_type} of length `{length}`.
fi: Olet yrittänyt antaa arvon `{name}`:n indeksille `{index}`, {obj_type}, jonka pituus on `{length}`.

source: The valid index values of `{name}` are integers ranging from `{min}` to `{max}`.
fi: `{name}`:n kelvolliset indeksiarvot ovat kokonaislukuja välillä `{min}` ja `{max}`.

source: Remember: the first item of {obj_type} is not at index 1 but at index 0.
fi: Muista: {obj_type}:n ensimmäinen kohde ei ole indeksissä 1 vaan indeksissä 0.

source: `{name}` contains no item.
fi: `{name}` ei sisällä mitään kohdetta.

source: You have tried to assign a value to index `{index}` of `{name}`, {obj_type} which contains no item.
fi: Olet yrittänyt antaa arvon indeksille `{index}` indeksissä `{name}`, {obj_type}, joka ei sisällä elementtiä.

source: You have tried to get an item of an object of type `{obj_type}` which I cannot identify. The index you gave was not an allowed value.
fi: Olet yrittänyt hakea elementtiä, jonka tyyppi on `{obj_type}`, jota en pysty tunnistamaan. Antamasi indeksi ei ole sallittu arvo.

source: You have tried to get an item from `{name}`, {obj_type} of length `{length}`, by using a value for the index that I cannot determine but which is not allowed.
fi: Olet yrittänyt hakea `{name}`, {obj_type}:stä elementin, jonka pituus on `{length}`, käyttämällä indeksin arvoa, jota en pysty määrittämään, mutta joka ei ole sallittu.

source: You have tried to get the item with index `{index}` of `{name}`, {obj_type} of length `{length}`.
fi: Olet yrittänyt saada kohteen, jonka indeksi on `{index}`, `{name}`, {obj_type} ja pituus `{length}`.

source: You have tried to get the item with index `{index}` of `{name}`, {obj_type} which contains no item.
fi: Olet yrittänyt saada kohteen, jonka indeksi on `{name}`, {obj_type}, jonka indeksi on `{index}` ja joka ei sisällä mitään kohdetta.

source: You tried to retrieve an item from an empty `dict` or a similar object which I cannot identify.
fi: Yritit hakea kohteen tyhjästä `dictistä` tai vastaavasta objektista, jota en pysty tunnistamaan.

source: `{name}` is an empty `dict`.
fi: `{name}` on tyhjä `dict`.

source: You tried to retrieve an item from `{name}` which is an empty `dict`.
fi: Yritit hakea elementin `{name}`:sta, joka on tyhjä `dict`.

source: You tried to retrieve an item from an empty ChainMap or similar object which I cannot identify.
fi: Yritit hakea kohteen tyhjästä ChainMapista tai vastaavasta kohteesta, jota en pysty tunnistamaan.

source: `{name}` is an empty `ChainMap`.
fi: `{name}` on tyhjä `ChainMap`.

source: You tried to retrieve an item from `{name}` which is an empty `ChainMap`.
fi: Yritit hakea elementin kohteesta `{name}`, joka on tyhjä `ChainMap`.

source: Missing key `{key}` in a `ChainMap` or in a similar object.
fi: Avain `{key}` puuttuu `ChainMapissa` tai vastaavassa objektissa.

source: A `dict` or a similar object which I cannot identify does not have `{key}` as a key.
fi: `dict`- tai vastaavalla objektilla, jota en pysty tunnistamaan, ei ole `{key}`-avainta.

source: The key `{key}` cannot be found in the dict `{name}`.
fi: Avainta `{key}` ei löydy diktaattorista `{name}`.

source: The key `{key}` cannot be found in `{name}`, an object of type `{obj_type}`.
fi: Avainta `{key}` ei löydy kohteesta `{name}`, jonka tyyppi on `{obj_type}`.

source: `{name}` contains a string key which is identical to `str({key})`. Perhaps you forgot to convert the key into a string.
fi: `{name}` sisältää merkkijonoavaimen, joka on sama kuin `str({key})`. Ehkä unohdit muuntaa avaimen merkkijonoksi.

source: Did you forget to convert `{key}` into a string?
fi: Unohditko muuntaa `{key}` merkkijonoksi?

source: `{key}` is a string. There is a key of `{name}` whose string representation is identical to `{key}`.
fi: `{key}` on merkkijono. On olemassa `{name}`-avain, jonka merkkijonoesitys on sama kuin `{key}`.

source: Did you convert `{key}` into a string by mistake?
fi: Muunnitko `{key}` vahingossa merkkijonoksi?

source: `{name}` is a key of `{dict_}` which is similar to `{key}`.
fi: `{name}` on `{dict_}`:n avain, joka on samanlainen kuin `{key}`.

source: `{name}` has some keys similar to `{key}` including: `{names}`.
fi: `{name}`:llä on joitakin `{key}`:n kaltaisia avaimia, kuten: `{names}`.

source: No additional information available since `{name}` cannot be imported.
fi: Lisätietoja ei ole saatavilla, koska `{name}` ei voida tuoda.

source: Did you mean `from {name} import {rest}`?
fi: Tarkoititko `from {name} import {rest}`?

source: `{rest}` is not a separate module but an object that is part of `{name}`.
fi: `{rest}` ei ole erillinen moduuli vaan objekti, joka on osa `{name}`:a.

source: Did you mean `import {name}.{attr}`?
fi: Tarkoititko `import {name}.{attr}`?

source: Perhaps you meant `import {name}.{attr}`. `{attr}` is a name similar to `{rest}` and is a module that can be imported from `{name}`.
fi: Ehkä tarkoitit `import {name}.{attr}`. `{attr}` on samanlainen nimi kuin `{rest}` ja se on moduuli, joka voidaan tuoda `{name}`:sta.

source: Did you mean `from {name} import {attr}`?
fi: Tarkoititko `from {name} import {attr}`?

source: Perhaps you meant `from {name} import {attr}`. `{attr}` is a name similar to `{rest}` and is an object that can be imported from `{name}`.
fi: Ehkä tarkoitit `from {name} import {attr}`. `{attr}` on samankaltainen nimi kuin `{rest}` ja on objekti, joka voidaan tuoda `{name}`:sta.

source: Other objects with similar names that are part of `{name}` include `{others}`.
fi: Muita samannimisiä objekteja, jotka ovat osa `{name}`:a, ovat esimerkiksi `{others}`.

source: `{rest}` cannot be imported from `{name}`.
fi: `{rest}` ei voi tuoda `{name}`:sta.

source: The curses module is rarely installed with Python on Windows.
fi: Curses-moduuli asennetaan harvoin Pythonin kanssa Windowsissa.

source: The curses module is often not installed with Python.
fi: Curses-moduulia ei useinkaan asenneta Pythonin mukana.

source: You have tried to import the curses module.
fi: Olet yrittänyt tuoda curses-moduulin.

source: No module named `{name}` can be imported. Note that there is a module named `{name}` that is part of the Python standard library. However, it might not be available for your operating system, or it may to be installed separately.
fi: Mitään moduulia nimeltä `{name}` ei voi tuoda. Huomaa, että on olemassa moduuli nimeltä `{name}`, joka on osa Pythonin standardikirjastoa. Se ei kuitenkaan välttämättä ole saatavilla käyttöjärjestelmääsi, tai se on asennettava erikseen.

source: No module named `{name}` can be imported. Perhaps you need to install it.
fi: Mitään moduulia nimeltä `{name}` ei voida tuoda. Ehkä sinun täytyy asentaa se.

source: The following existing modules have names that are similar to the module you tried to import: `{names}`
fi: Seuraavilla olemassa olevilla moduuleilla on samankaltaiset nimet kuin moduulilla, jota yritit tuoda: `{names}`

source: `{name}` is an existing module that has a similar name.
fi: `{name}` on olemassa oleva moduuli, jolla on samanlainen nimi.

source: You are already using Python!
fi: Käytät jo Pythonia!

source: `{name}` is a name found in module `{mod}`. Perhaps you forgot to write from {mod} import {name}
fi: `{name}` on nimi, joka löytyy moduulista `{mod}`. Ehkä unohdit kirjoittaa from {mod} import {name}.

source: `{name}` is a name found in the following modules: {modules}. Perhaps you forgot to import `{name}` from one of these modules.
fi: `{name}` on nimi, joka löytyy seuraavista moduuleista: {modules}. Ehkä olet unohtanut tuoda `{name}` jostain näistä moduuleista.

source: In your program, `{var_name}` is an unknown name that exists in an enclosing scope, but has not yet been assigned a value.
fi: Ohjelmassasi `{var_name}` on tuntematon nimi, joka on olemassa ympäröivässä laajuudessa, mutta jolle ei ole vielä annettu arvoa.

source: In your program, no object with the name `{var_name}` exists.
fi: Ohjelmassasi ei ole objektia nimellä `{var_name}`.

source: Or did you mean `{name}`?
fi: Vai tarkoititko `{name}`?

source: Did you use a colon instead of an equal sign?
fi: Käytitkö kaksoispistettä yhtäläisyysmerkin sijasta?

source: Perhaps you meant to write `{name}` and also forgot to import it.
fi: Ehkä sinun oli tarkoitus kirjoittaa `{name}` ja unohdit myös tuoda sen.

source: Did you mean `1j`?
fi: Tarkoititko `1j`?

source: However, sometimes `{name}` is intended to represent the square root of `-1` which is written as `1j` in Python.
fi: Joskus `{name}` on kuitenkin tarkoitettu edustamaan `-1`:n neliöjuurta, joka Pythonissa kirjoitetaan `1j`.

source: Did you mean `{word}`?
fi: Tarkoititko `{word}`?

source: I suspect you meant to write the keyword `{word}` and made a typo.
fi: Epäilen, että tarkoituksesi oli kirjoittaa avainsana `{word}` ja teit kirjoitusvirheen.

source: `__debug__` is a constant.
fi: `__debug__` on vakio.

source: `__debug__` is a constant that cannot be deleted. In future Python versions, attempting to delete it will be a SyntaxError.
fi: `__debug__` on vakio, jota ei voi poistaa. Tulevissa Python-versioissa sen poistaminen aiheuttaa SyntaxErrorin.

source: You must be a fan of PyConAu!
fi: Sinun täytyy olla PyConAun fani!

source: I am guessing that you tried to use (one of) the flipfloperators shown during the second Lightning Talk session of PyConAu 2018, but that you forgot to install the module from PyPI. #### Note that it is still a bad idea.
fi: Arvelen, että yritit käyttää (yhtä) PyConAu 2018:n toisen Lightning Talk -session aikana esiteltyjä flipfloperatoreita, mutta unohdit asentaa moduulin PyPI:stä. #### Huomaa, että se on silti huono idea.

source: Did you forget to import `{name}`?
fi: Unohditko tuoda `{name}`?

source: The name `{name}` is not defined in your program. Perhaps you forgot to import `{lowercase}` which is found in Python's standard library.
fi: Nimeä `{name}` ei ole määritelty ohjelmassasi. Ehkä unohdit tuoda `<{lowercase}`, joka löytyy Pythonin standardikirjastosta.

source: Note that the name of the module is `{lowercase}` and not `{name}`.
fi: Huomaa, että moduulin nimi on `{lowercase}` eikä `{name}`.

source: There is a module named `{name}` that is part of the Python standard library. However, it might not be available for your operating system, or it may to be installed separately.
fi: On olemassa moduuli nimeltä `{name}`, joka on osa Pythonin standardikirjastoa. Se ei kuitenkaan välttämättä ole saatavilla käyttöjärjestelmääsi, tai se on asennettava erikseen.

source: The name `{name}` is not defined in your program. Perhaps you forgot to import `{name}` which is a known library.
fi: Nimeä `{name}` ei ole määritelty ohjelmassasi. Ehkä unohdit tuoda `{name}`, joka on tunnettu kirjasto.

source: Did you forget to import `{true_name}`?
fi: Unohditko tuoda `{true_name}`?

source: The name `{name}` is not defined in your program. Perhaps you forgot to write import {true_name} as {name}
fi: Nimeä `{name}` ei ole määritelty ohjelmassasi. Ehkä unohdit kirjoittaa import {true_name} as {name}.

source: The similar name `{name}` was found in the local scope.
fi: Samankaltainen nimi `{name}` löytyi paikallisesta alueesta.

source: The similar name `{name}` was found in the global scope.
fi: Samanlainen nimi `{name}` löytyi globaalista alueesta.

source: The Python builtin `{name}` has a similar name.
fi: Pythonin sisäänrakennetulla `{name}`:lla on samanlainen nimi.

source: Instead of writing `{name}`, perhaps you meant one of the following:
fi: Sen sijaan, että kirjoittaisit `{name}`, ehkä tarkoitit jotakin seuraavista:

source: * Local scope:
fi: * Paikallinen soveltamisala:

source: * Global scope:
fi: * Maailmanlaajuinen soveltamisala:

source: Did you write `self` at the wrong place?
fi: Kirjoititko `self` väärään kohtaan?

source: The {scope} object `{obj}` has an attribute named `{unknown_name}`. Perhaps you should have written `self.{unknown_name}(...` instead of `{unknown_name}(self, ...`.
fi: {scope}-objektilla `{obj}` on attribuutti nimeltä `{unknown_name}`. Ehkä sinun olisi pitänyt kirjoittaa `self.{unknown_name}(...` eikä `{unknown_name}(self, ...`.

source: Did you forget to add `self.`?
fi: Unohditko lisätä `self.`?

source: A {scope} object, `{obj}`, has an attribute named `{unknown_name}`. Perhaps you should have written `self.{unknown_name}` instead of `{unknown_name}`.
fi: {scope}-oliolla, `{obj}`, on attribuutti nimeltä `{unknown_name}`. Ehkä sinun olisi pitänyt kirjoittaa `self.{unknown_name}` eikä `{unknown_name}`.

source: Did you forget to add `{name}.`?
fi: Unohditko lisätä `{name}.`?

source: The {scope} object `{name}` has an attribute named `{unknown_name}`. Perhaps you should have written `{name}.{unknown_name}` instead of `{unknown_name}`.
fi: {scope}-objektilla `{name}` on attribuutti nimeltä `{unknown_name}`. Ehkä sinun olisi pitänyt kirjoittaa `{name}.{unknown_name}` eikä `{unknown_name}`.

source: I suspect that you are trying to connect to a server and that a connection cannot be made. If that is the case, check for typos in the URL and check your internet connectivity.
fi: Epäilen, että yrität muodostaa yhteyttä palvelimeen, mutta yhteyttä ei saada muodostettua. Jos näin on, tarkista, onko URL-osoitteessa kirjoitusvirheitä, ja tarkista internet-yhteys.
